{
  "title": "The Boston Strangler: True Crime Walking Tour Guide",
  "slug": "boston-strangler-true-crime-history",
  "id": 46002,
  "status": "publish",
  "post_type": "post",
  "uri": "/articles/boston-strangler-true-crime-history/",
  "date": "2026-02-13 12:00:00",
  "modified": "2026-02-13 12:00:00",
  "content": "<p>Between 1962 and 1964, thirteen women were murdered in their Boston apartments. The case reshaped American true crime and still haunts the city.</p>\n\n<p>This article is part of our <a href=\"/boston-ghost-tours/\">comprehensive Boston ghost tours guide</a>. Whether you're planning a visit or researching from afar, these stories reveal a side of Boston most visitors never see.</p>\n\n<h2>Starting Point and Route Overview</h2> <p>Have you ever walked a neighborhood and felt the weight of a story before you reach the first marker? This walking tour of sites associated with the Boston Strangler moves through neighborhoods in Boston and nearby communities where murders, investigations, and long-held rumors took place between 1962 and 1964. The route is designed to be chronological and geographic: it begins in South Boston and neighborhoods of the Back Bay, continues through Dorchester and Jamaica Plain, and finishes at Franklin Park and surrounding areas where some victims were discovered.</p> <p>You will want to plan for roughly two to three hours on foot, depending on how much time you spend at each stop and whether you pause for photos or research. Some stop locations are residential buildings, so respect property and privacy: look, photograph from public sidewalks, and avoid disturbing residents. The route intentionally includes public spaces—parks, streets, and former boarding houses—so you can place the murders in their urban context and see how the cityscape of the 1960s shaped criminal investigations and local folklore.</p> <p>On a practical note, dress for Boston weather. Streets are often uneven near older brownstones and in park areas, and some addresses are better viewed from the curb or across the street. The guide below lists specific addresses and dates tied to each stop. Use a city map or GPS for navigation, and consider pairing the walk with historical research at the Boston Public Library (700 Boylston St.) or the Massachusetts State Archives (220 Morrissey Blvd.) so you can cross-reference courthouse records, period newspaper coverage, and police files while you tour.</p> \n\n<img src=\"https://images.pexels.com/photos/2411688/pexels-photo-2411688.jpeg?auto=compress&cs=tinysrgb&w=1200&h=800&fit=crop\" alt=\"Historic brick buildings in Boston\" loading=\"lazy\" style=\"border-radius: 8px; width: 100%; height: auto; margin: 1.5rem 0;\" />\n\n<h2>Timeline of the Strangler Murders (1962–1964)</h2> <p>Context matters. The Boston Strangler murders took place during a busy, sometimes chaotic period in Boston’s history. Below is a succinct timeline of major events related to the series most commonly grouped under the name “Boston Strangler.” This concise chronology helps you place sites on the tour against a backdrop of investigative milestones and cultural responses.</p> <p> <table> <tr><th>Date</th><th>Event</th></tr> <tr><td>June 1962</td><td>First attacks widely associated with the Strangler begin in Boston-area neighborhoods; several women die or are found assaulted.</td></tr> <tr><td>1962–1964</td><td>A series of murders of women across Boston and surrounding towns; contemporary tallies most often list 13 victims attributed to the Strangler.</td></tr> <tr><td>November 1964</td><td>Albert H. DeSalvo confesses to a long string of sexual assaults and later claims responsibility for the Strangler murders; the confession raises controversies about motive and veracity.</td></tr> <tr><td>1967</td><td>DeSalvo is convicted for a series of unrelated sexual assaults (the “Green Man” rapes) and receives a life sentence rather than a conviction for murder.</td></tr> <tr><td>1973</td><td>Albert DeSalvo is stabbed to death in Walpole State Prison on November 25, 1973.</td></tr> <tr><td>2013</td><td>Suffolk County officials announce that modern DNA testing links DeSalvo to at least one 1964 victim, renewing public debate about the scope of his culpability.</td></tr> </table> </p> <p>That short timeline points to why the case remains of interest to historians, criminologists, and ghost-tour visitors: the mixture of confirmed evidence, contested confessions, and incomplete investigations left open questions that have been debated for decades. As you move from stop to stop, keep this timeline in mind so locations and dates line up in your memory and on local plaques or archival photographs you may encounter.</p> \n\n<img src=\"https://images.pexels.com/photos/6494953/pexels-photo-6494953.jpeg?auto=compress&cs=tinysrgb&w=1200&h=800&fit=crop\" alt=\"Foggy cemetery on a gloomy day\" loading=\"lazy\" style=\"border-radius: 8px; width: 100%; height: auto; margin: 1.5rem 0;\" />\n\n<h2>Key Stops and Addresses on the Tour</h2> <p>This section lists specific addresses and sites you will encounter on the tour. When possible, addresses are given as public-facing locations you can view from sidewalks. Many original interiors have been renovated or repurposed, but the exterior context remains essential to understanding how investigators worked and how neighbors remember the crimes.</p> <p>Representative stops include (note: always respect private property): - 95 Brattle Street area (Cambridge/Back Bay border): several early attacks and suspicious encounters occurred in the broader Back Bay and Cambridge margins; street-level observation helps you see transit corridors used in the 1960s. - A number of victims lived or were found in multi-unit brownstones on Commonwealth Avenue and Bay State Road; walking along these stretches shows the type of housing targeted. - Dorchester and Jamaica Plain residential blocks where assaults were reported; these neighborhoods were home to victims who lived alone or with elderly relatives. - Franklin Park (1 Carty Drive, Roxbury): an open area where at least one victim’s body was discovered. The park’s winding paths and underbrush made searches difficult in 1964 and still factor into how visitors perceive the scene today.</p> <p>These are not exhaustive; the tour may include additional addresses based on archival records and contemporary reporting. A common practice is to supplement location visits with period photographs or newspaper clippings you can bring or reference on your phone—many public libraries and the Boston Globe’s historical archives have searchable images and articles. As you stand at each address, consider the architecture, the proximity to transit, and the social dynamics of the 1960s: single women living alone, locked doors versus open windows, and the patterns of late-night movement that investigators studied.</p> \n\n<img src=\"https://images.pexels.com/photos/5765828/pexels-photo-5765828.jpeg?auto=compress&cs=tinysrgb&w=1200&h=800&fit=crop\" alt=\"Historic building facade at twilight\" loading=\"lazy\" style=\"border-radius: 8px; width: 100%; height: auto; margin: 1.5rem 0;\" />\n\n<h2>Documented Evidence, Suspects, and Controversies</h2> <p>The forensic and investigative record is central to understanding both the true-crime history and the folklore that followed. Albert H. DeSalvo acknowledged responsibility for a swath of sexual assaults and provided details that some investigators found convincing. In 1967 he was convicted on charges linked to a series of separate sexual offenses. He was never convicted in a Massachusetts court for the Strangler murders themselves, and debates about whether one person committed all 13 murders persist.</p> <p>Investigative controversies include the following points of contested fact: - Confession reliability: DeSalvo gave a detailed confession to authorities, but investigators and defense attorneys disagreed over whether his statements proved responsibility for every murder. - Forensic linkages: Until modern testing, forensics could not definitively connect DeSalvo to specific crime scenes. In 2013, Suffolk County officials announced that DNA linked DeSalvo to the 1964 murder of one victim, an announcement that narrowed the debate but did not conclusively attribute every killing to him. - Multiple-perpetrator theory: Some investigators and family members argue different assailants may have been responsible for different murders, citing variations in method, geography, and victim profile.</p> <p>When you examine court records or contemporary newspaper reports on the tour, watch for the differences between initial press coverage and later forensic reports. Early reporting often amplified fear—headlines and sensational copy—whereas later archival study tends to be more measured. Understanding the limits of technology and procedure in the early 1960s will help you separate confirmed details from speculation and folklore that grew in the years after the crimes.</p> <h2>Reported Paranormal Activity and Witness Accounts</h2> <p>Sites associated with violent deaths often accumulate ghost stories; the Strangler locations are no exception. Present these reports with respectful skepticism: document what witnesses say without endorsing supernatural explanations. At least two distinct types of paranormal reports have circulated around Strangler sites—apparitions believed to be victims and unexplained auditory or tactile phenomena near discovery sites.</p> <p>One frequently reported experience occurs near Franklin Park, close to the area where a victim’s body was found. Local walkers and a small number of independent investigators have reported seeing a young woman at dusk who vanishes when approached, or feeling sudden drops in temperature along specific park paths. According to multiple local forum posts and a 2009 investigation by a New England paranormal group, witnesses described a scent of cigarette smoke or perfume without a nearby source and an uneasy feeling of being watched near the north meadow. While these are anecdotal, they have persisted in local oral history and influenced the way visitors sense the landscape.</p> <p>Another recurring report comes from residents and former tenants of older Commonwealth Avenue and Back Bay brownstones who say they’ve heard unexplained footsteps in stairwells, the sound of a woman calling from a hallway, or intermittent tapping on windows late at night. Some statements appear in local ghost-hunting blogs and in personal accounts collected by neighborhood historians. Those who investigate these claims cite EMF spikes, cold spots, and recorded EVP (electronic voice phenomena) clips—though skeptics and many professional investigators caution that building acoustics, plumbing, and the city environment often explain such effects.</p> <p>When you hear these stories on the walk, ask about provenance: who reported the experience, when it occurred, and whether there were witnesses or physical recordings. That approach maintains the balance between curiosity and critical inquiry, allowing you to appreciate the role folklore plays in how communities remember trauma while distinguishing eyewitness accounts from confirmation bias or environmental causes.</p> <h2>Practical Tips, Ethical Considerations, and Visitor Etiquette</h2> <p>Walking a true-crime route requires sensitivity. Many locations on this tour are private residences or are near families who lost loved ones. You should refrain from trespassing, photographing through windows, or conducting intrusive behavior at addresses tied to victims. If you plan to record audio or video for research, notify property owners or seek permission when you are on private property; public sidewalks and parks are the appropriate places for observation.</p> <p>When you discuss the cases with others, prioritize victims and their families. Use full names and dates when they help clarify historical facts, but avoid sensational language that diminishes the humanity behind the headlines. Recognize that haunting narratives sometimes supplant the real stories of individuals: victims had jobs, families, and lives beyond how they were reported in the press. If you encounter local historians, archivists, or descendants who offer more context, treat their perspectives with respect and gratitude.</p> <p>Safety and logistics: bring a charged phone, comfortable shoes, and a small flashlight if you plan to be out near dusk. Be mindful of city ordinances and park hours—Franklin Park and other public spaces may have specific closing times. If you intend to consult archives after the walk, call ahead to confirm operating hours at the Boston Public Library or the Suffolk County District Attorney’s office for public records access.</p> <p>Finally, if you are leading others on the route or posting about the tour online, include trigger warnings for violent content and provide resources for those affected by trauma. Balancing a factual presentation of criminal history with empathetic regard for victims and their families preserves the dignity of the places you visit and ensures your interest in Boston ghost and Boston haunted history contributes to informed remembrance rather than exploitative sensation.</p>\n\n<hr />\n\n<h3>Continue Reading</h3>\n<ul>\n<li><a href=\"/articles/most-haunted-places-in-boston/\">Most Haunted Places in Boston: A Local's Guide</a></li>\n<li><a href=\"/articles/boston-freedom-trail-dark-history/\">The Freedom Trail's Dark Side: Death, Disease, and Revolution</a></li>\n<li><a href=\"/articles/omni-parker-house-boston-haunted-history/\">The Omni Parker House: Boston's Most Haunted Hotel</a></li>\n<li><a href=\"/boston-ghost-tours/\">Boston Ghost Tours — Complete Guide</a></li>\n</ul>",
  "excerpt": "Chronological walking tour of Boston Strangler sites—addresses, timeline, ethics, archives and tips for a respectful 2-3 hour true-crime exploration with maps.",
  "categories": [
    {
      "id": 586,
      "slug": "boston-haunted-history",
      "name": "Boston Haunted History",
      "description": "Articles exploring the haunted landmarks, dark history, and supernatural legends of Boston — from colonial-era ghosts to the Freedom Trail's darkest stories."
    }
  ],
  "pageType": "unassigned",
  "featuredImage": {
    "sourceUrl": "https://images.unsplash.com/photo-1508193638397-1c4234db14d8?w=1200&h=630&fit=crop&q=80",
    "altText": "The Boston Strangler: True Crime Walking Tour Guide"
  }
}