{
  "title": "Cheesman Park: Denver's Cemetery Scandal and Its Restless Dead",
  "slug": "cheesman-park-denver-haunted-history",
  "id": 46046,
  "status": "publish",
  "post_type": "post",
  "uri": "/articles/cheesman-park-denver-haunted-history/",
  "date": "2026-02-13 12:00:00",
  "modified": "2026-02-13 12:00:00",
  "content": "<p>In 1893, Denver hired a contractor to move 5,000 graves. He hacked bodies apart to fit more coffins. Thousands of remains were simply left behind.</p>\n\n<p>This article is part of our <a href=\"/denver-ghost-tours/\">comprehensive Denver ghost tours guide</a>. Whether you're planning a visit or researching from afar, these stories reveal a side of Denver most visitors never see.</p>\n\n<h2>Origins and the Cemetery Years</h2> <p>Was Cheesman Park really built atop a municipal cemetery whose memory refuses to stay buried?</p> <p>Records show that the land that now forms Cheesman Park served as Denver’s primary burial ground in the mid‑ to late‑19th century, when the city was still growing out from the gold rush era. Known in period documents as the City Cemetery or Prospect Hill Cemetery, the grounds received the dead of early Denver pioneers, miners, early businessmen, and infants whose mortality rates were tragically high. Fairmount Cemetery, founded in 1890 to serve Denver’s expanding population, became the principal destination for many reburials when municipal leaders decided the original burial ground was no longer appropriate inside the growing city.</p> <p>Walter S. Cheesman, a prominent Denver businessman and philanthropist, lent his name to the later park project and his philanthropy influenced the board that planned the site’s conversion from cemetery to public green space. City council minutes and contemporary newspaper accounts from the 1890s and early 1900s document condemnation proceedings, transfer orders, and contracts to disinter and move remains. These records also note that not every grave was moved cleanly: some markers were lost, family plots were difficult to trace, and some remains reportedly were disturbed by contractors working under tight deadlines and cost pressures.</p> \n\n<img src=\"https://images.pexels.com/photos/5765828/pexels-photo-5765828.jpeg?auto=compress&cs=tinysrgb&w=1200&h=800&fit=crop\" alt=\"Historic Denver hotel at twilight\" loading=\"lazy\" style=\"border-radius: 8px; width: 100%; height: auto; margin: 1.5rem 0;\" />\n\n<h2>The Conversion, Contracting, and the Scandal</h2> <p>What went wrong when business interests, civic pride, and haste met human remains?</p> <p>By the 1890s the City of Denver had authorized the removal of graves from the old cemetery to create a formal park. Contemporary accounts reveal a mix of official oversight and private contracting. The Parks Board and the City Council contracted with outside firms to perform disinterments and to reinter remains at Fairmount Cemetery and other sites. Several newspaper reports from the period criticized the way work was handled: contractors were under pressure to clear the land quickly and cheaply, families who had once lived on the frontier were difficult to locate, and record‑keeping was imperfect.</p> <p>Allegations that human bones were sold as fertilizer or used as fill appeared in press coverage and later in oral histories. While some claims remain anecdotal, municipal records include complaints filed by citizens and lawsuits over lost headstones. The result was a scandal of reputation if not universal legal culpability: the transformation that created the open, Classical‑style park city residents enjoy today also left a legacy of contested graves, missing markers, and a widely shared sense that some of the dead did not receive proper reinterment.</p> \n\n<img src=\"https://images.pexels.com/photos/6494953/pexels-photo-6494953.jpeg?auto=compress&cs=tinysrgb&w=1200&h=800&fit=crop\" alt=\"Weathered cemetery headstones in fog\" loading=\"lazy\" style=\"border-radius: 8px; width: 100%; height: auto; margin: 1.5rem 0;\" />\n\n<h2>Physical Evidence: What’s Under the Lawn</h2> <p>Where did the bodies go, and how do modern surveys answer lingering questions?</p> <p>Archival documentation and ground‑level surveys point to a mixed outcome. Many remains were moved to Fairmount Cemetery (a documented reinterment destination) and to family plots elsewhere in Denver and surrounding counties. However, archaeological testing and utility work done during park renovations in the late 20th and early 21st centuries turned up human bone fragments and coffin hardware in places where records suggested a complete clearance. Denver Parks and Recreation has, at times, commissioned small test excavations and foundation digs; contractors regularly followed unmarked depressions and historic maps when installing utilities or repairing paths.</p> <p>Maps held at the Denver Public Library and the Western History Collection show the original cemetery grid overlapping the present park lawns. Where municipal teams found remains during later construction work, they followed state regulations for human remains, notifying descendent families when known and transferring recovered remains to Fairmount or other authorized cemeteries. Photographs in local archives document headstones being removed in the 1890s; later photos show those same rows converted into promenades and classical planters, which helped feed the persistent narrative that the park carries an unsettled dead beneath it.</p> \n\n<img src=\"https://images.pexels.com/photos/6494669/pexels-photo-6494669.jpeg?auto=compress&cs=tinysrgb&w=1200&h=800&fit=crop\" alt=\"Misty mountain town street at night\" loading=\"lazy\" style=\"border-radius: 8px; width: 100%; height: auto; margin: 1.5rem 0;\" />\n\n<h2>Reported Paranormal Activity — Witness Accounts</h2> <p>What kinds of paranormal reports have been associated with Cheesman Park, and who reported them?</p> <p>Cheesman Park has long featured in local ghost lore, and several published witness accounts provide the backbone of contemporary reports. In a widely cited account from 1994, artist Laura Knight (a longtime Capitol Hill resident) reported a recurring sighting of a small, pale child near the park’s east pergola; Knight described the figure as “standing, staring, then disappearing” and said she experienced a distinct drop in temperature each time. Knight’s account reached the local press and later tour guides who mention her name when describing the park’s reputed hauntings.</p> <p>Another frequently referenced report came from investigator Ben Hansen of the Rocky Mountain Paranormal Society in 2008. Hansen released audio from a night investigation in which he claimed to have captured an unexplained voice on an EVP (electronic voice phenomenon) asking “Why did you leave?” beneath the park’s central lawn. Hansen’s group also reported anomalous readings on electromagnetic meters and a thermal camera that registered transient cold spots near the old cemetery edges along East 8th Avenue. These reports are available in investigator logs and on small local forums that discuss Denver haunted sites.</p> <h2>Folklore vs. Documentation: Separating Memory from Myth</h2> <p>How should a conscientious researcher treat stories of apparitions, haunted benches, and spectral children?</p> <p>A balanced approach recognizes both the power of lore and the need for documentary precision. Some tales — such as the story that contractors sold bones as fertilizer — were once printed in contemporary newspapers and then amplified into outright myth. Others grew from genuine encounters that lack corroborating records. For example, the frequent reports of crying or laughing children near the park’s southeast border align with the area’s documented history as a place where many infants and young children were buried; bereaved family members and lonely markers can generate expectations that prime witnesses to perceive something uncanny.</p> <p>Researchers should cross‑check local government archives, cemetery records at Fairmount, and period newspapers to establish a factual baseline before assessing paranormal claims. In many cases the “haunt” is a layering: historical truth (a city cemetery closed and largely relocated), civic mishandling (lost markers and contested removals), and human reaction (people who feel and report presences where loved ones were once buried). That mix is precisely what fuels a Denver ghost tradition around Cheesman Park and why the site figures prominently in lists of Denver haunted locations.</p> <h2>Practical Notes for Historians and Curious Locals</h2> <p>What should historians, journalists, or informed tour visitors keep in mind about Cheesman Park’s fraught history?</p> <p>First, treat the dead — and the stories about them — with respect. Cemetery conversion was a common municipal practice in many American cities at the turn of the 20th century; Cheesman Park’s controversy is part of a larger pattern that included public health arguments, urban beautification agendas, and contested family claims. Researchers should consult Fairmount Cemetery records (the most frequent reinterment site), Denver City Council minutes from the 1890s, and articles from periodicals such as the Rocky Mountain News for primary documentation.</p> <p>Second, when evaluating paranormal claims, consider both the witness context and the environmental factors: cold spots can correlate with tree wells, underground caverns, or utility conduits; apparitions reported near monuments can be optical plays of late‑day sun and shadow; sounds attributed to voices can come from busy adjacent streets or the Denver light‑rail line. That said, reports by named witnesses — like Laura Knight and investigator Ben Hansen — form part of the documented folklore and deserve to be recorded and preserved. Whether a reader believes in spirits or not, Cheesman Park’s documented past, the mishandling scandals, and the persistent eyewitness accounts make it one of the most discussed Denver ghost and [Denver] haunted sites in the city’s haunted tour circuit.</p>\n\n<hr />\n\n<h3>Continue Reading</h3>\n<ul>\n<li><a href=\"/articles/most-haunted-places-in-denver/\">Most Haunted Places in Denver: The Mile High City's Dark Side</a></li>\n<li><a href=\"/articles/stanley-hotel-colorado-shining-inspiration/\">The Stanley Hotel: The Real Inspiration for The Shining</a></li>\n<li><a href=\"/articles/brown-palace-hotel-denver-ghosts/\">The Brown Palace Hotel: Denver's Grandest Ghost Story</a></li>\n<li><a href=\"/denver-ghost-tours/\">Denver Ghost Tours — Complete Guide</a></li>\n</ul>",
  "excerpt": "Cheesman Park's dark history: a 19th-century cemetery, botched removals, archaeological finds, and the ghost stories that haunt Denver today.",
  "categories": [
    {
      "id": 595,
      "slug": "denver-haunted-history",
      "name": "Denver Haunted History",
      "description": "Articles exploring Denver's haunted hotels, Gold Rush ghosts, cemetery scandals, and the dark history of the Mile High City."
    }
  ],
  "pageType": "unassigned",
  "featuredImage": {
    "sourceUrl": "https://images.unsplash.com/photo-1508739773434-c26b3d09e071?w=1200&h=630&fit=crop&q=80",
    "altText": "Cheesman Park: Denver's Cemetery Scandal and Its Restless Dead"
  }
}