{
  "title": "Congress Plaza Hotel: Haunted History",
  "slug": "congress-plaza-hotel-haunted-history",
  "excerpt": "Open since 1893, the Congress Plaza Hotel on Michigan Avenue has accumulated over a century of ghost stories—from sealed-off ballrooms to Room 441.",
  "featuredImage": {
    "sourceUrl": "/images/articles/congress-plaza-hotel-haunted-history.jpg",
    "altText": "Grand historic hotel facade at night",
    "width": 1200,
    "height": 630
  },
  "content": "The Congress Plaza Hotel at 520 South Michigan Avenue has been in continuous operation since 1893, when it opened to accommodate visitors to the World's Columbian Exposition. In the 131 years since, it has hosted presidents, gangsters, literary figures, and—according to staff and guests—a considerable population of the dead.\n\nThe Congress is not merely a hotel with a few ghost stories. It is a building where paranormal reports span its entire history, from multiple independent sources, across every floor and wing. It has been investigated by numerous paranormal research teams and has been featured in several television programs about haunted locations. More importantly, it has generated consistent reports from guests and employees who had no knowledge of the building's reputation before their experiences.\n\n\n\n<h2>A Hotel Built on History</h2>\nThe Congress was designed by Clinton J. Warren and opened as the Auditorium Annex, serving as an extension to Adler and Sullivan's landmark Auditorium Building next door. It was rechristened the Congress Hotel in 1908 and has undergone numerous expansions and renovations since.\n\nThe hotel's guest list reads as a history of American power. Presidents Grover Cleveland, William McKinley, Theodore Roosevelt, William Howard Taft, and Woodrow Wilson all stayed at the Congress. Al Capone maintained a suite on the eighth floor. Babe Ruth was a frequent guest. And in Room 209 on the second floor, a guest whose identity was never established reportedly took their own life—one of several such incidents in the hotel's history.\n\nThe Congress has also been the site of significant labor disputes. In 2003, hotel workers went on strike in a dispute that lasted over a decade, leaving entire floors of the hotel unstaffed and unoccupied for years. These dark, empty corridors—furnished but abandoned—created an environment that even skeptics acknowledge is unsettling.\n\n\n\n<h2>Room 441</h2>\n\n<img src=\"https://images.pexels.com/photos/34728173/pexels-photo-34728173.jpeg?auto=compress&cs=tinysrgb&w=1200&h=800&fit=crop\" alt=\"Long ornate hotel hallway with moody lighting\" loading=\"lazy\" style=\"border-radius: 8px; width: 100%; height: auto; margin: 1.5rem 0;\" />\n\nRoom 441, on the fourth floor, generates the most frequent and consistent reports. Guests have described being touched by unseen hands while sleeping, hearing whispered conversations in empty rooms, finding their belongings rearranged after leaving the room briefly, and experiencing a pervasive sense of being watched that intensifies after dark.\n\nThe room's reputation is well enough established that some guests specifically request it, while others refuse to stay on the fourth floor at all. Hotel staff have confirmed that Room 441 generates more complaints about unusual experiences than any other room in the building, though they are careful to note that the room is fully functional and safe.\n\nWhat actually happened in Room 441 to generate its reputation is unclear. Unlike locations associated with specific historical events—a murder, a suicide, a disaster—the room's haunting lacks a clear origin story. This is actually more common in haunted hotel reports than the public imagines: many of the most actively reported rooms have no documented history of violence or death. The phenomena simply occur, consistently, without a satisfying narrative explanation.\n\n<h2>The Gold Room</h2>\nThe Gold Room, a once-grand ballroom on the hotel's lower levels, has been sealed off from public access for decades. The room's closure has varied explanations depending on the source—structural concerns, renovation plans, or simply lack of demand for a ballroom of that size.\n\n<img src=\"https://images.pexels.com/photos/2823459/pexels-photo-2823459.jpeg?auto=compress&cs=tinysrgb&w=1200&h=800&fit=crop\" alt=\"Dark monochrome hallway with an ominous atmosphere\" loading=\"lazy\" style=\"border-radius: 8px; width: 100%; height: auto; margin: 1.5rem 0;\" />\n\nStaff who enter the Gold Room for maintenance report experiences that are consistent and specific: the sound of orchestra music in a room with no sound system, cold drafts in a sealed interior space with no ventilation, the strong sensation of a crowd in an empty room, and visual phenomena including shadows that move independently of any light source.\n\nThe Gold Room's inaccessibility contributes to its mystique but also makes it difficult to investigate systematically. The few paranormal teams that have been granted access report elevated electromagnetic readings and temperature anomalies consistent with—but not proof of—paranormal activity.\n\n\n\n<h2>The Eighth Floor</h2>\n\nAl Capone's connection to the Congress is well documented. He maintained rooms on the eighth floor during the height of his power in the late 1920s. The suite allowed him a view of Grant Park and Lake Michigan while keeping him above the street-level chaos of his operations.\n\nReports of cigar smoke on the eighth floor—in rooms where smoking has been prohibited for years—are among the most distinctive phenomena at the Congress. Capone was inseparable from his cigars, and the olfactory nature of these reports gives them a specificity unusual in haunted location claims. Staff members have independently reported the smell, typically in the corridor outside the rooms Capone is known to have occupied.\n\n<h2>Other Phenomena</h2>\n\nBeyond the specific hotspots, the Congress generates a broad range of reports across its entire footprint. Guests have reported hearing children running in empty hallways, seeing figures in period clothing who vanish when approached, and experiencing elevator malfunctions where the car stops at floors that were not selected—particularly floors associated with reported activity.\n\nThe <a href=\"/articles/most-haunted-places-in-chicago/\">hotel's position</a> within Chicago's haunted landscape is unique. Unlike <a href=\"/articles/bachelors-grove-cemetery-chicago/\">Bachelor's Grove</a> or <a href=\"/articles/resurrection-mary-chicagos-most-famous-ghost/\">Resurrection Cemetery</a>, the Congress is accessible to anyone willing to book a room. The ghosts, if they exist, share the building with paying guests, housekeeping staff, and maintenance workers—an arrangement that has produced a steady stream of reports for over a century.\n\nFor visitors exploring <a href=\"/chicago-ghost-tours/\">Chicago's haunted history</a>, the Congress offers something that most ghost tour stops cannot: the opportunity to spend the night in a location with documented paranormal reports, in a room where previous guests have described their own experiences, and to determine for yourself whether the Congress Plaza Hotel is merely old—or genuinely haunted.\n\n<hr />\n\n<h3>Continue Reading</h3>\n<ul>\n<li><a href=\"/articles/most-haunted-places-in-chicago/\">Chicago's Most Haunted Places</a></li>\n<li><a href=\"/articles/chicago-gangster-ghosts/\">Chicago's Gangster Ghosts</a></li>\n<li><a href=\"/articles/chicagos-most-haunted-bars/\">Chicago's Most Haunted Bars</a></li>\n<li><a href=\"/chicago-ghost-tours/\">Chicago Ghost Tours Hub</a></li>\n</ul>",
  "id": 60007,
  "status": "publish",
  "post_type": "post",
  "uri": "/articles/congress-plaza-hotel-haunted-history/",
  "date": "2026-02-12 12:00:00",
  "modified": "2026-02-12 12:00:00",
  "pageType": "unassigned",
  "categories": [
    {
      "id": 600,
      "slug": "chicago-haunted-history",
      "name": "Chicago Haunted History",
      "description": "The dark history behind Chicago's hauntings—from the Great Fire and H.H. Holmes to Resurrection Mary, gangster ghosts, and the city's most haunted landmarks."
    }
  ],
  "wordCount": 931,
  "readingTime": 4,
  "articleType": "cluster"
}