{
  "title": "The Eastland Disaster: Chicago's Deadliest Day",
  "slug": "eastland-disaster-chicago",
  "excerpt": "The SS Eastland capsized in the Chicago River in 1915, killing 844 people. The aftermath still haunts the city.",
  "featuredImage": {
    "sourceUrl": "/images/articles/eastland-disaster-chicago.jpg",
    "altText": "Chicago River with city buildings reflecting in dark water",
    "width": 1200,
    "height": 630
  },
  "content": "On the morning of July 24, 1915, the SS Eastland sat docked at the Clark Street bridge on the Chicago River, loading passengers for a Western Electric company picnic to Michigan City, Indiana. The ship never left the dock. At approximately 7:28 a.m., with over 2,500 passengers aboard, the Eastland rolled onto its port side in twenty feet of water. Within minutes, 844 people were dead—drowned, crushed, or suffocated in a disaster that remains the largest loss of life from a single shipwreck on the Great Lakes.\n\nThe Eastland Disaster killed more passengers relative to capacity than the Titanic. It happened not in the open ocean but in a river, within sight of downtown Chicago, in water shallow enough to stand in. And yet, within a generation, the city had largely forgotten it. The dead, however, did not forget.\n\n\n<figure class=\"my-8\"><img src=\"/images/articles/inline/eastland-disaster-chicago-3.jpg\" alt=\"The Eastland Disaster: Chicago's Deadliest Day\" loading=\"lazy\" class=\"rounded-lg w-full\" /></figure>\n<h2>The Morning of July 24</h2>\nWestern Electric's Hawthorne Works in Cicero employed thousands of workers, mostly Czech, Polish, and other Eastern European immigrants. The annual company picnic was the social event of the year. Five chartered ships were scheduled to carry approximately 7,000 employees and their families across Lake Michigan.\n\nThe Eastland, a passenger steamer built in 1903, had a known history of stability problems. It had nearly capsized on several previous occasions, and naval engineers had raised concerns about its top-heaviness. Despite these warnings, the ship was certified for passenger service.\n\nPassengers began boarding around 6:30 a.m. Families crowded the upper decks, children running to the railings for a view of the river. By 7:00 a.m., the ship had developed a noticeable list to port. Water began entering through lower openings. The crew attempted to stabilize the vessel by adjusting ballast tanks, but the ship continued to roll.\n\nAt 7:28 a.m., the Eastland rolled completely onto its side. Passengers on the upper decks were thrown into the river. Those below deck were trapped as water flooded the interior. The screaming lasted only a few minutes before it stopped.\n\n\n<figure class=\"my-8\"><img src=\"/images/articles/inline/eastland-disaster-chicago-1.jpg\" alt=\"The Morning of July 24\" loading=\"lazy\" class=\"rounded-lg w-full\" /></figure>\n<h2>844 Dead</h2>\n\nThe death toll was staggering. Entire families were wiped out. Twenty-two families from the same neighborhood in Cicero lost every member. The youngest victim was an infant. Many victims were teenage girls—Western Electric employed large numbers of young women in its assembly operations.\n\nRescue efforts began immediately but were hampered by the chaos. The ship lay on its side in the river, its hull protruding above the waterline. Rescuers cut holes in the exposed hull with acetylene torches, pulling survivors from air pockets inside. Others dove into the murky river, retrieving bodies from the submerged compartments.\n\nThe temporary morgue was established at the 2nd Regiment Armory at 1058 West Washington Boulevard, six blocks from the disaster site. Bodies were laid in rows on the armory floor for identification. Families filed past the dead for days, searching for their relatives. The scenes of identification—parents recognizing children, husbands identifying wives—were described by witnesses as the most harrowing aspect of the disaster.\n\n<h2>The Armory: Harpo Studios</h2>\nThe 2nd Regiment Armory where the dead were laid out eventually became Harpo Studios, the production facility for The Oprah Winfrey Show from 1988 to 2015. Employees at the studio reported unexplained phenomena throughout its decades of operation.\n\nThe reports were consistent and came from multiple independent sources: the sound of children laughing or crying in empty corridors, doors that opened and closed on their own, cold spots that appeared without ventilation explanations, footsteps in unoccupied areas, and a pervasive sense of being watched in certain sections of the building. Security guards on overnight shifts were particularly vocal about experiences they could not explain.\n\nThe connection between the building's use as a temporary morgue—where 844 bodies were displayed for identification—and the reported phenomena was well known within the Harpo Studios staff. Whether the experiences reflected genuine paranormal activity or the psychological weight of working in a space with such history is an open question. What is not debatable is that dozens of employees, across years of operation, independently reported similar experiences.\n\n\n<figure class=\"my-8\"><img src=\"/images/articles/inline/eastland-disaster-chicago-2.jpg\" alt=\"The Armory: Harpo Studios\" loading=\"lazy\" class=\"rounded-lg w-full\" /></figure>\n<h2>The Disaster Site Today</h2>\n\nThe Clark Street bridge where the Eastland capsized still spans the Chicago River. A small memorial plaque on the south side of the bridge marks the location, though many Chicagoans and tourists pass it without noticing. The river itself shows no trace of what happened—the current flows, tour boats pass, and the city's architecture rises on both sides as if nothing occurred.\n\nReports of unusual phenomena at the disaster site are less frequent than at the armory but not absent. River cruise operators have reported electronic equipment malfunctions near the Clark Street bridge that do not occur elsewhere on their routes. Pedestrians have described hearing sounds—crying, splashing, voices—that seem to come from the water on still nights. These reports are anecdotal and impossible to verify, but they are consistent with the pattern of phenomena reported at other Chicago disaster sites.\n\n<h2>Why Chicago Forgot</h2>\n\nThe Eastland Disaster is sometimes called \"the forgotten tragedy\" because it never achieved the cultural resonance of the Great Fire or the St. Valentine's Day Massacre. Several factors contributed to this amnesia. The victims were predominantly working-class immigrants, not the city's elite. The disaster occurred just as World War I was consuming public attention. And the city's response—cleanup, legal proceedings, move on—followed the same pattern established after the Great Fire.\n\nThe forgetting is itself a kind of haunting. A city that lost 844 people in a single morning, in its own river, and then allowed the event to fade from collective memory has created exactly the conditions that ghost stories are designed to address. The dead insist on being remembered. If the living will not do it through monuments and memorials, then perhaps they will do it through cold spots in corridors, sounds from the water, and the persistent unease of places where something terrible happened and was never adequately mourned.\n\n<a href=\"/articles/most-haunted-places-in-chicago/\">Chicago's haunted landscape</a> is built on disasters that the city preferred to build over rather than memorialize. The Eastland Disaster is the most extreme example: the deadliest single incident in the city's history, reduced to a small plaque on a bridge that most people walk past without pausing.\n\n<hr />\n\n<h3>Continue Reading</h3>\n<ul>\n<li><a href=\"/articles/most-haunted-places-in-chicago/\">Chicago's Most Haunted Places</a></li>\n<li><a href=\"/articles/great-chicago-fire-ghosts/\">The Great Chicago Fire: Ghosts of 1871</a></li>\n<li><a href=\"/articles/resurrection-mary-chicagos-most-famous-ghost/\">Resurrection Mary</a></li>\n<li><a href=\"/chicago-ghost-tours/\">Chicago Ghost Tours Hub</a></li>\n</ul>",
  "id": 60003,
  "status": "publish",
  "post_type": "post",
  "uri": "/articles/eastland-disaster-chicago/",
  "date": "2026-02-12 12:00:00",
  "modified": "2026-02-12 12:00:00",
  "pageType": "unassigned",
  "categories": [
    {
      "id": 600,
      "slug": "chicago-haunted-history",
      "name": "Chicago Haunted History",
      "description": "The dark history behind Chicago's hauntings—from the Great Fire and H.H. Holmes to Resurrection Mary, gangster ghosts, and the city's most haunted landmarks."
    }
  ],
  "wordCount": 1058,
  "readingTime": 4,
  "articleType": "cluster"
}