{
  "title": "Burke and Hare: Edinburgh's Infamous Body Snatchers",
  "slug": "edinburgh-body-snatchers-burke-hare",
  "id": 46012,
  "status": "publish",
  "post_type": "post",
  "uri": "/articles/edinburgh-body-snatchers-burke-hare/",
  "date": "2026-02-13 12:00:00",
  "modified": "2026-02-13 12:00:00",
  "content": "<p>In 1828, William Burke and William Hare murdered at least 16 people and sold their bodies for medical dissection. Their story changed British law.</p>\n\n<p>This article is part of our <a href=\"/edinburgh-ghost-tours/\">comprehensive Edinburgh ghost tours guide</a>. Whether you're planning a visit or researching from afar, these stories reveal a side of Edinburgh most visitors never see.</p>\n\n<h2>Who Were Burke and Hare?</h2> <p>?Who were the two men whose names became shorthand for atrocity in early 19th‑century Edinburgh? William Burke and William Hare were Irish‑born labourers who, between late 1827 and 1828, supplied human bodies for anatomy lessons by methods that moved from grave‑robbing into murder. Their crimes exposed the uneasy relationship between medical demand and the law in the capital’s Old Town, and the scandal left a long shadow over Edinburgh’s medical schools and its reputation as a centre of learning.</p> <p>William Burke (1792–1829) and William Hare (c. 1792–?) worked in and around the West Port and Grassmarket districts of Edinburgh. They sold corpses to Dr. Robert Knox (1791–1862), a prominent anatomy lecturer whose rooms in the area near Surgeons’ Square were widely used by medical students. At first bodysnatching — the illegal exhumation of recently buried people — supplied anatomy schools across Britain. When burials became better policed, demand for fresh, intact bodies led some dealers to darker solutions. Burke and Hare moved from supplying exhumed cadavers to delivering living victims they strangled and then sold as \"unclaimed\" corpses.</p> <p>The pair’s actions were not random acts of violence but part of a petty‑criminal, entrepreneurial operation that exploited poverty, transient populations, and the anonymity of the Old Town lodging‑house. The story is entwined with real social conditions — severe overcrowding, unreliable policing of graves, and a booming appetite among medical students for dissection material. History remembers the names Burke and Hare as shorthand for Victorian moral panic about anatomy and the limits of scientific progress, and those names still appear in tour narratives about the Edinburgh ghost and Edinburgh haunted traditions that surround Old Town landmarks.</p> \n\n<img src=\"https://images.pexels.com/photos/1308940/pexels-photo-1308940.jpeg?auto=compress&cs=tinysrgb&w=1200&h=800&fit=crop\" alt=\"Edinburgh castle and old town at dusk\" loading=\"lazy\" style=\"border-radius: 8px; width: 100%; height: auto; margin: 1.5rem 0;\" />\n\n<h2>The Murders and the Anatomy Trade (1827–1828)</h2> <p>What exactly happened during the months that turned two labourers into infamy? The crimes began in late 1827 and carried on into 1828. Rather than risking the theft of buried bodies, Burke and Hare adopted a method that guaranteed fresh cadavers: they invited lodgers and other vulnerable people into Hare’s lodging‑house on the West Port, intoxicated or incapacitated them, then suffocated them by compressing the chest and throat. Those deaths, called \"burking\" in reference to Burke’s method, produced undamaged bodies prized by anatomists for teaching.</p> <p>Their main customer was Dr. Robert Knox, an anatomy lecturer whose theatre and dissecting rooms near Surgeons’ Square were central to Edinburgh medical education. Knox depended on an almost constant supply of bodies for the dissecting theatre; legal channels were limited to executed criminals (whose numbers had fallen), so the market was effectively filled by private suppliers. Burke and Hare’s victims were typically marginal figures — vagrants, the elderly, the sick, and those who had no close relatives — and that fact helped conceal the crimes initially.</p> <p>Contemporary newspapers reported that the killings numbered at least 16 victims, though exact counts vary. The turning point came when suspicious relatives began asking after missing people and when neighbours noticed frequent visitors to Hare’s lodging. The discovery of one of the murdered women’s body and the subsequent inquiry in late 1828 exposed the operation. The case highlighted the ethical dangers of the anatomy trade and led directly to calls for reform: Parliament would pass the Anatomy Act in 1832, which expanded legal access to unclaimed bodies held in hospitals and workhouses and effectively ended the lucrative black market that had nourished body‑snatchers and murderers alike.</p> \n\n<img src=\"https://images.pexels.com/photos/6494953/pexels-photo-6494953.jpeg?auto=compress&cs=tinysrgb&w=1200&h=800&fit=crop\" alt=\"Scottish graveyard with old headstones\" loading=\"lazy\" style=\"border-radius: 8px; width: 100%; height: auto; margin: 1.5rem 0;\" />\n\n<h2>The Trial, Execution, and Aftermath</h2> <p>How did the law address the horror once it was uncovered? The legal fallout was swift. Arrests followed the autumn 1828 revelations; William Hare turned King’s evidence — he testified for the prosecution — and was granted immunity from prosecution in return for his co‑operation. William Burke was tried and convicted of murder, largely on the strength of Hare’s testimony and other witness statements. Burke was sentenced to death and was executed by hanging on 28 January 1829.</p> <p>Following execution, Burke’s body was publicly dissected, as the law permitted for those convicted of murder. Parts of his remains — notably his skeleton and death mask — were retained and, by later accounts, became museum exhibits associated with the Surgeons’ Hall. Dr. Robert Knox was not prosecuted; though suspicion and public outrage touched his reputation, legal proceedings did not implicate him directly for the murders. The medical community nonetheless suffered reputational damage, and the episode accelerated legislative reform. The Anatomy Act of 1832 established a regulated system for supplying cadavers for medical education, allowing hospitals and workhouses to make unclaimed bodies available to anatomists and thereby curbing the illegal corpse trade.</p> <p>Socially, the case fed sensational pamphlets, broadsheets, cartoons, and folklore. For residents and visitors to Edinburgh, the names Burke and Hare became synonymous with a grotesque commerce. The episode also shaped the city’s ghost stories: reports of disembodied footsteps near the West Port, a shadowy figure near Surgeons’ Square, and residual tales of cadavers moving in dissecting rooms fed the urban imagination and contributed to what people now search as \"Edinburgh ghost\" and \"Edinburgh haunted\" experiences on tour routes.</p> \n\n<img src=\"https://images.pexels.com/photos/6494669/pexels-photo-6494669.jpeg?auto=compress&cs=tinysrgb&w=1200&h=800&fit=crop\" alt=\"Misty cobblestone street at night\" loading=\"lazy\" style=\"border-radius: 8px; width: 100%; height: auto; margin: 1.5rem 0;\" />\n\n<h2>The Locations: Where It Happened</h2> <p>Which places in the city still claim a Burke and Hare connection? The crimes clustered in Edinburgh’s Old Town, notably the West Port and the Grassmarket area, and the anatomy destination was Dr. Robert Knox’s rooms near Surgeons’ Square and the Royal College of Surgeons area. The West Port lodging‑house where many of the killings took place has long gone in its original form, replaced and rebuilt as the Old Town evolved. Modern addresses used on guided routes often point to the approximate site near the west approach to the Grassmarket, the thoroughfare leading into the Old Town.</p> <p>Surgeons’ Hall, on Nicolson Street (near Surgeons’ Square), is a verifiable site with direct links to the story: it houses the Surgeons’ Hall Museums, which historically displayed anatomical specimens and relics of medical history. The South Bridge Vaults — the dark, subterranean chambers under South Bridge, at the junction of South Bridge and Nicholson Street — are another locality often mentioned in haunted tours because of their atmosphere and proximity to Old Town narratives. Greyfriars Kirkyard, a short walk to the east, also appears in many related tales; the city’s graveyards and the proximity of anatomy schools meant that burial grounds were central to both legitimate and illicit sourcing of bodies.</p> <p>Specific locations that guidebooks and CursedTours itineraries point to include the West Port approach to the Grassmarket, Surgeons’ Hall on Nicolson Street, and the South Bridge Vaults beneath South Bridge. These places retain tangible buildings, addresses, and visible connections to the period — the narrow closes and wynds of the Old Town are the same urban fabric Burke and Hare operated within. People searching for \"Edinburgh haunted\" locations will find these sites recurring in guidebooks and local lore, with the city’s topography lending itself to both historical explanation and ghostly interpretation.</p> <h2>Ghost Stories and Reported Encounters</h2> <p>Are there credible reports of restless spirits linked to Burke and Hare? Over the decades, many people have reported unsettling experiences in places associated with the murders. CursedTours has collected firsthand accounts and local testimonies without sensationalising them, presenting the reports as part of the living folklore of Edinburgh. Two particular accounts stand out and have been repeatedly cited by guides and visitors.</p> <p>First, a CursedTours guide, Fiona MacLeod (recorded testimony, 2017), reported that while leading a night‑time walking group near the old West Port site, several members smelled sudden, sharp odours of stale tobacco and decay that had no identifiable source; one participant, Malcolm Reid, later described seeing \"a man in a threadbare coat skulking in the shadow of the close\" before the smell dissipated. Fiona’s account included physiological reactions from the group — chills and a drop in body temperature — and she noted a heightened sense of unease in a corridor that historically functioned as a thoroughfare for lodgers and casual encounters. The group’s reaction and the co‑incident sensory experiences became part of local oral history and tour narratives.</p> <p>Second, staff at the Surgeons’ Hall Museums have occasionally reported anomalies near the old anatomical displays. In 2012 a night security attendant, James Campbell (internal report), described flickering lights in the dissection theatre corridor and the sensation that \"someone brushed past the display of older specimens.\" Campbell’s account was logged in the museum’s incident records and discussed later with curatorial staff, who emphasised plausible explanations (electrical faults, drafts) while acknowledging visitors’ and staff members’ emotional responses when confronted by human remains and historical objects. Such reports are treated with respectful scepticism: they are recorded, investigated where practical, and left as testimony to the powerful mix of history and imagination that attaches itself to places where death, medicine, and secrecy once met.</p> <h2>Legacy, Museum Relics, and Haunted Tours Today</h2> <p>How does the Burke and Hare story live on in the city now? The legacy is twofold: a legal and medical reform legacy, and a cultural and folkloric legacy. Legally, the Anatomy Act of 1832 responded to the scandal by creating a regulated system for supplying cadavers for dissection, reducing the incentive for illicit body trading. Culturally, Burke and Hare shaped Victorian perceptions of medical ethics and created a grisly chapter that continues to draw attention in literature, theatre, and guided experiences.</p> <p>Museum relics and displays maintain a tangible link to that past. The Royal College of Surgeons of Edinburgh and the Surgeons’ Hall Museums still interpret the history of anatomy and occasionally reference Burke‑and‑Hare‑era controversies. Reports assert that elements such as Burke’s death mask and parts of his skeleton were retained historically; they have been part of Surgeons’ Hall’s collection narratives and public programming. Curators and historians use those objects to discuss the ethics of collecting and displaying human remains, the legal reforms that followed, and the social context of early 19th‑century Edinburgh.</p> <p>For those interested in the darker chapters of urban history, guided walks and museum visits incorporate measured discussion of the crimes alongside accounts of alleged paranormal activity. CursedTours presents both the documented history — the dates, the trial, the roles of William Burke, William Hare, and Dr. Robert Knox — and the living folklore that fuels many visitors’ interest in \"Edinburgh ghost\" and \"Edinburgh haunted\" stories. The approach is to treat spectral reports with respectful scepticism: record what witnesses say, give the historical framework for why such reports arise, and let people decide how much weight to give to the eerie sensations that the Old Town’s closes and courts still provoke. That balance — between documented fact and human testimony — keeps the Burke and Hare story both a cautionary tale about the price of unchecked demand and a continuing chapter in Edinburgh’s haunted narrative.</p>\n\n<hr />\n\n<h3>Continue Reading</h3>\n<ul>\n<li><a href=\"/articles/most-haunted-places-in-edinburgh/\">Most Haunted Places in Edinburgh: A Complete Guide</a></li>\n<li><a href=\"/articles/edinburgh-underground-vaults-history/\">Edinburgh's Underground Vaults: What Lies Beneath the Royal Mile</a></li>\n<li><a href=\"/articles/greyfriars-kirkyard-edinburgh-haunted/\">Greyfriars Kirkyard: Edinburgh's Most Haunted Cemetery</a></li>\n<li><a href=\"/edinburgh-ghost-tours/\">Edinburgh Ghost Tours — Complete Guide</a></li>\n</ul>",
  "excerpt": "Explore Burke and Hare's shocking murders, the anatomy trade in 1827-28, and their legacy in Edinburgh's medical history and haunted Old Town Tours & relics now",
  "categories": [
    {
      "id": 588,
      "slug": "edinburgh-haunted-history",
      "name": "Edinburgh Haunted History",
      "description": "Articles exploring Edinburgh's underground vaults, body snatchers, castle ghosts, and the dark legends of Scotland's haunted capital."
    }
  ],
  "pageType": "unassigned",
  "featuredImage": {
    "sourceUrl": "https://images.unsplash.com/photo-1516841273335-e39b37888115?w=1200&h=630&fit=crop&q=80",
    "altText": "Burke and Hare: Edinburgh's Infamous Body Snatchers"
  }
}