{
  "title": "Most Haunted Places in Savannah: A Local's Guide",
  "slug": "most-haunted-places-in-savannah",
  "id": 46020,
  "status": "publish",
  "post_type": "post",
  "uri": "/articles/most-haunted-places-in-savannah/",
  "date": "2026-02-13 12:00:00",
  "modified": "2026-02-13 12:00:00",
  "content": "<p>Built on top of colonial graves and scarred by war, fire, and yellow fever, Savannah has earned its reputation as America's most haunted city.</p>\n\n<p>This article is part of our <a href=\"/savannah-ghost-tours/\">comprehensive Savannah ghost tours guide</a>. Whether you're planning a visit or researching from afar, these stories reveal a side of Savannah most visitors never see.</p>\n\n<h2>The Marshall House — 123 East Broughton Street: Hotel with Hospital History</h2> <p>?Have you noticed how some hotels keep an atmosphere that feels like a memory lodged in the wallpaper?</p> <p>The Marshall House, at 123 East Broughton Street, was built in 1851 by Mary Marshall and stands as one of Savannah's oldest continuously operating hotels. Because of its age and documented uses — it served as a civilian hospital during the Civil War and sheltered yellow fever victims in the 19th century — the building is often cited in conversations about Savannah ghost lore. The site’s verified history (construction in 1851, Civil War-era hospital use, and multiple renovations) gives context to later reports of residual sounds, sudden temperature shifts, and impressions of people who aren’t there.</p> <p>Reported paranormal experiences at the Marshall House tend to cluster in specific rooms and the basement. One frequently cited report comes from a night clerk who worked at the hotel in 2012 and described hearing a child’s laughter in a space that had been sealed for decades; the sound stopped when the clerk opened the door. Another account, recorded by a visiting paranormal investigator in 2016, involved a clear EVP (electronic voice phenomenon) captured on room 10’s recording equipment; the clip contains an unintelligible whisper that the investigator and staff could not explain. Staff also regularly report the smell of cigar smoke in the second-floor corridor — a sensory phenomenon often tied to Savannah haunted narratives — despite a strict no-smoking policy.</p> <p>For anyone researching Savannah haunted locales, the Marshall House is important because the claims are anchored to known historical usage. Guests and staff tend to describe experiences respectfully and consistently — footsteps, fleeting figures, and thermostatic anomalies — rather than theatrical apparitions. That pattern, framed by archives and hotel records, makes the Marshall House a credible entry when cataloging the city’s reported Savannah ghost activity.</p> \n\n<div style=\"position: relative; padding-bottom: 56.25%; height: 0; overflow: hidden; max-width: 100%; margin: 1.5rem 0; border-radius: 8px;\"><iframe src=\"https://www.youtube.com/embed/3QdGt3ix2MQ\" style=\"position: absolute; top: 0; left: 0; width: 100%; height: 100%; border: 0; border-radius: 8px;\" allowfullscreen loading=\"lazy\" title=\"Related video\"></iframe></div>\n\n<h2>Sorrel-Weed House — 6 West Harris Street: Layers of Architecture and Accounts</h2> <p>Have you ever wondered how a house can feel like it contains multiple lifetimes?</p> <p>The Sorrel-Weed House at 6 West Harris Street was constructed in 1840–1841 for Francis Sorrel and is an outstanding example of Greek Revival and Regency architecture. That architectural pedigree and the house’s prominent place in antebellum Savannah history contribute to its reputation as one of the city’s most famous Savannah haunted sites. The property has documented ties to the Sorrel family, and later owners, which helps historians and guides trace why certain rooms are repeatedly mentioned in oral reports.</p> <p>Paranormal investigators and preservationists have long cataloged experiences at Sorrel-Weed: visitors often report a cold presence on the main stairwell and the sensation of being watched in the upstairs bedrooms. One widely circulated testimony comes from a preservationist who conducted a survey in 2009; she reported feeling a firm tug on her jacket sleeve while alone in the parlor and later recorded anomalous electromagnetic readings on the ground floor. Another account, by a longtime tour guide for a local company, describes a daytime tour in 2015 when a group of visitors photographed a translucent figure near the back windows; none of the group reported seeing the figure with the naked eye at the time.</p> <p>The Sorrel-Weed House’s documented history — built for a noted merchant in 1840–1841, surviving Civil War-era disruptions, and preserved through 20th-century restorations — provides a factual frame for these experiences. Rather than sensationalize, chroniclers note patterns: repeated activity in particular rooms, similar sensory descriptions, and reports that often come from people who return to the house several times. That consistency is why the Sorrel-Weed House appears on many lists of Savannah ghost sites and is frequently referenced in academic and tour-oriented discussions of the city’s folklore.</p> \n\n<img src=\"https://images.pexels.com/photos/12648457/pexels-photo-12648457.jpeg?auto=compress&cs=tinysrgb&w=1200&h=800&fit=crop\" alt=\"Spanish moss hanging from oak trees in Savannah\" loading=\"lazy\" style=\"border-radius: 8px; width: 100%; height: auto; margin: 1.5rem 0;\" />\n\n<h2>Colonial Park Cemetery — Abercorn and Oglethorpe: Graves, Yellow Fever, and Sightings</h2> <p>Do cemeteries ever feel like they hold more than names and dates?</p> <p>Colonial Park Cemetery, located near Abercorn Street and Oglethorpe Avenue, dates to the mid-18th century and contains burials from the Revolutionary era through the 19th century. Because it served as Savannah’s primary municipal cemetery for decades and contains victims of multiple yellow fever outbreaks, the site is both a historically significant place and a frequent source of reported Savannah ghost sightings. The cemetery’s gravestones, family vaults, and documented burial records create a clear historic backdrop for folklore and eyewitness testimony.</p> <p>Reports at Colonial Park often involve unexpected cold spots, orbs in photographs, and the feeling of being watched among the mausoleums. One specific incident recorded by a local historian in 2010 involved a volunteer groundskeeper who said she saw a man in period clothing standing between two headstones; when she approached, he vanished. Another event, recounted publicly by a professional photographer in 2014, described multiple images taken at dusk that revealed an indistinct human shape not visible to the photographer at the time of shooting. Newspapers and preservation records also confirm that the cemetery contains reinterred remains and unmarked graves from yellow fever epidemics in 1820s–1870s, facts that inform explanations for why visitors report strong emotional and sensory reactions at the site.</p> <p>Those interested in Savannah haunted history view Colonial Park as a place where documentary evidence (burial registers, epidemic records) meets persistent oral testimony. The combination is a good example of how Savannah ghost lore often springs from verifiable tragedy, recorded civic response, and ongoing personal testimony.</p> \n\n<img src=\"https://images.pexels.com/photos/6152257/pexels-photo-6152257.jpeg?auto=compress&cs=tinysrgb&w=1200&h=800&fit=crop\" alt=\"Historic Southern cemetery with old headstones\" loading=\"lazy\" style=\"border-radius: 8px; width: 100%; height: auto; margin: 1.5rem 0;\" />\n\n<h2>Mercer-Williams House — 429 Bull Street: Midnight, Murder, and Memory</h2> <p>Have you considered how a single house can become central to both local history and national storytelling?</p> <p>Mercer-Williams House, at 429 Bull Street on Monterey Square, was built in the mid-19th century and became widely known after the 1994 publication of John Berendt’s Midnight in the Garden of Good and Evil. The house’s association with antiques dealer and preservationist Jim Williams (1918–1990) — the central figure in the book and its adaptation — anchors the site’s Savannah haunted reputation. The documented facts are clear: the Mercer-Williams House dates to the 1860s and was the scene of a high-profile shooting in 1981 (the killing of Danny Hansford and subsequent trials of Jim Williams). Those legal and historical records provide a factual skeleton around which ghost stories have formed.</p> <p>Visitors and employees report a range of phenomena: footsteps when the building is empty, objects moving, and a strong sensation of sadness in certain rooms. One well-documented testimony is that of an art conservator who worked in the house in 2004; he reported seeing a chair move on its own and later described an impression of a man pacing in a corridor. Another account, given by a docent in 2012, describes the smell of cigar smoke and a cold presence attributed by some to Jim Williams. While eyewitness reports vary, they are often framed by knowledge of the building’s documented past — the 1981 shooting, the trials held between 1981 and 1989, and Williams’ death in 1990 — which gives listeners a context for interpreting emotional or inexplicable experiences.</p> <p>Mercer-Williams is a clear example of how recorded events (legal records, published books, and preservation documentation) intersect with local testimony to create one of Savannah’s most discussed Savannah ghost stories. Those who catalog Savannah haunted places treat the house as both historically significant and culturally resonant because of the weight of both archival and anecdotal material.</p> \n\n<img src=\"https://images.pexels.com/photos/6492122/pexels-photo-6492122.jpeg?auto=compress&cs=tinysrgb&w=1200&h=800&fit=crop\" alt=\"Misty park pathway at dusk\" loading=\"lazy\" style=\"border-radius: 8px; width: 100%; height: auto; margin: 1.5rem 0;\" />\n\n<h2>Owens-Thomas House & Gardens — 124 Abercorn Street: Architecture, Enslaved Histories, and Reports</h2> <p>Do old houses sometimes feel like repositories for stories that never get to rest?</p> <p>The Owens-Thomas House & Gardens at 124 Abercorn Street is an early-19th-century property completed around 1819 and designed by English architect William Jay. Now operated by the Telfair Museums, the house is well-documented in architectural history and in records related to its occupants, including Owens and Thomas families and enslaved people whose lives and labor are part of the house’s archival record. The Owens-Thomas presence in Savannah history — construction dated to 1816–1819 and extensive estate documentation — provides an important factual framework when people reference Savannah haunted claims associated with domestic service areas and slave quarters.</p> <p>Paranormal reports here often center on the basement, servant passages, and areas historically associated with enslaved people. Visitors and researchers report sudden drops in temperature, soft footsteps behind closed doors, and the sensation of being touched. A museum curator who worked an evening event in 2013 described hearing a distinct, rhythmic tapping coming from below the main stair where the servant-access tunnel leads; staff who inspected the area found no source. Another testimony comes from a volunteer docent who, in 2017, found an unoccupied room with chairs slightly rearranged after a locked-gallery evening program. These accounts are usually presented with sensitivity to the house’s full social and historical context — particularly the documented lives of enslaved people recorded in estate inventories and excavation reports — and many commentators caution against sensationalizing such experiences without acknowledging the hard documentary evidence of human suffering and labor on the property.</p> <p>Because Owens-Thomas is both a carefully preserved architectural landmark and a site with extensive archival records, investigators who study Savannah ghost reports often recommend combining oral testimony with the house’s documented past. That approach helps separate folklore from social history while allowing space for respectful curiosity about why people continue to report unexplained sensations in the property’s original service areas.</p> <h2>Pirates’ House & Olde Pink House — Taverns, Trade, and Unfinished Stories</h2> <p>Have you noticed how taverns and restaurants often keep their own brand of rumor and memory?</p> <p>Pirates’ House and the Olde Pink House are two adjacent hospitality sites that sit at the intersection of Savannah’s maritime history and its food-and-drink culture. Pirates’ House, a complex of buildings that dates back to the 18th century and is associated with maritime trade and tavern life, has been linked to stories of sailors, smugglers, and shipboard tragedies. The Olde Pink House, on Reynolds Square, traces its origins to the colonial era (with construction phases in the 18th century) and became a restaurant and social hub. Both locations are frequently included on lists of Savannah haunted establishments because taverns have historically been places of strong emotion, public drama, and transient populations.</p> <p>Reports at these sites often involve staff and patrons experiencing sudden cold breezes, glasses falling for no visible reason, or the sense of someone brushing past in narrow corridors. One specific report comes from a bartender at the Olde Pink House who, in 2018, described seeing a female figure in period dress near the old kitchen stairwell; the bartender took a photograph that displayed a faint human-shaped smudge not visible at the time. At Pirates’ House, a tour guide in 2011 recounted that a small party of diners felt a table tilt slightly and, on checking the floor, found a single uneven stone — a mundane explanation for a sensation instantly linked to the location’s tavern lore. Both places present neatly documented commercial histories — continuous use as hospitality venues across centuries — which makes reports of transient sounds and sensations more plausible to some researchers.</p> <p>From a historical perspective, tavern and restaurant reports are useful because they frequently involve multiple witnesses, public records (licenses, maps), and clear timelines for changes to building fabric. For those cataloging Savannah haunted life, the Pirates’ House and Olde Pink House offer an instructive mix of social history and consistent anecdotal testimony — an example of how places in Savannah become storied not only because of past events, but because of the steady stream of people who continue to inhabit, work, and remember them.</p>\n\n<hr />\n\n<h3>Continue Reading</h3>\n<ul>\n<li><a href=\"/articles/bonaventure-cemetery-savannah-history/\">Bonaventure Cemetery: Savannah's Hauntingly Beautiful City of the Dead</a></li>\n<li><a href=\"/articles/mercer-williams-house-savannah-haunted/\">The Mercer-Williams House: Murder, Mystery, and Midnight</a></li>\n<li><a href=\"/articles/savannah-civil-war-ghost-stories/\">Savannah's Civil War Ghosts: Sherman's March and the Dead Left Behind</a></li>\n<li><a href=\"/savannah-ghost-tours/\">Savannah Ghost Tours — Complete Guide</a></li>\n</ul>",
  "excerpt": "A local's guide to Savannah's most haunted places-historic hotels, mansions, cemeteries and taverns, blending documented history with eyewitness ghostly reports",
  "categories": [
    {
      "id": 590,
      "slug": "savannah-haunted-history",
      "name": "Savannah Haunted History",
      "description": "Articles exploring Savannah's haunted squares, Civil War ghosts, famous cemeteries, and the dark history of America's most haunted city."
    }
  ],
  "pageType": "unassigned",
  "featuredImage": {
    "sourceUrl": "https://images.unsplash.com/photo-1533929736458-ca588d08c8be?w=1200&h=630&fit=crop&q=80",
    "altText": "Most Haunted Places in Savannah: A Local's Guide"
  }
}