{
  "title": "Most Haunted Places in Denver: The Mile High City's Dark Side",
  "slug": "most-haunted-places-in-denver",
  "id": 46045,
  "status": "publish",
  "post_type": "post",
  "uri": "/articles/most-haunted-places-in-denver/",
  "date": "2026-02-13 12:00:00",
  "modified": "2026-02-13 12:00:00",
  "content": "<p>Denver's ghost stories run from Gold Rush saloons to Victorian mansions — and one very famous park built on top of a cemetery.</p>\n\n<p>This article is part of our <a href=\"/denver-ghost-tours/\">comprehensive Denver ghost tours guide</a>. Whether you're planning a visit or researching from afar, these stories reveal a side of Denver most visitors never see.</p>\n\n<h2>Brown Palace Hotel & Spa — 321 17th Street</h2> <p>Have you ever wondered why some hotels feel like they remember everyone who’s ever passed through their lobby? The Brown Palace Hotel & Spa in downtown Denver has that exact reputation; opened in 1892 by Henry C. Brown, it’s a living piece of Denver architecture that wears its history visibly. You’ll notice the triangular atrium, the oak-paneled lobby and the long service tradition that produced decades of staff lore. Address: 321 17th Street, Denver, CO 80202.</p> <h3>History</h3> <p>The Brown Palace was completed on August 12, 1892, and quickly became Denver’s premier hotel. Henry C. Brown built it as a statement of permanence during Denver’s boom years; notable guests have included presidents Theodore Roosevelt and Dwight D. Eisenhower, as well as business leaders and celebrities through the 20th century. The building’s continuous use as a hotel means stories and objects from many eras remain in situ, which helps explain why the place attracts attention from both historians and those interested in the [Denver ghost] scene.</p> <h3>Paranormal reports</h3> <p>You’ll hear several recurring motifs in accounts from guests and staff: footsteps at odd hours on empty hallways, a child’s laughter near the elevators, and the sense of a presence in suites that have been closed for years. Longtime employees report lights turning on and off and elevators stopping between floors without mechanical explanation. One widely circulated experience describes a night concierge who felt a heavy presence in the lobby and then saw the portrait of a 1930s pianist appear to weep; the concierge’s account was included in a 2010 collection of local testimonies compiled by a Denver historical society. Approach these reports with respectful skepticism: many occurrences can be traced to building acoustics, old wiring, or human expectation, but they persist in the hotel’s folklore and contribute to its status as a Denver haunted landmark.</p> \n\n<div style=\"position: relative; padding-bottom: 56.25%; height: 0; overflow: hidden; max-width: 100%; margin: 1.5rem 0; border-radius: 8px;\"><iframe src=\"https://www.youtube.com/embed/m5_MZuyAWOo\" style=\"position: absolute; top: 0; left: 0; width: 100%; height: 100%; border: 0; border-radius: 8px;\" allowfullscreen loading=\"lazy\" title=\"Related video\"></iframe></div>\n\n<h2>Molly Brown House Museum — 1340 Pennsylvania Street</h2> <p>Did you know that one of Denver’s most famous socialites left behind more than philanthropy? The Molly Brown House, at 1340 Pennsylvania Street (Denver, CO 80203), is both a museum and a magnet for stories about the afterlife. You’ll find the home associated with Margaret “Molly” Brown, who survived the RMS Titanic in 1912, fought for labor and women’s causes, and died in 1932. The museum preserves much of her furniture and personal effects, which makes it fertile ground for reports of residual activity and visitor encounters.</p> <h3>History</h3> <p>The house was built in 1889 by James Joseph Brown and was purchased in 1894 by Margaret and James Brown. After Molly Brown’s death, the house went through multiple owners and uses before preservation efforts turned it into a museum in 1970. The museum emphasizes her civic work, but its late-19th-century interiors and continuous public access create layers of human activity that are often cited in [Denver haunted] narratives.</p> <h3>Paranormal reports</h3> <p>You’ll hear of footsteps in rooms after closing, a piano that seems to play faintly when it’s been secured, and visitors who smell cigar smoke in areas where smoking is prohibited. Docent accounts often form the backbone of these reports; on several documented museum nights volunteers have described cold spots in the parlor and the sense of being watched while cataloguing artifacts. One report recorded during a documented after-hours program in 2015 noted an EMF spike and a disembodied voice captured on a recorder; museum staff cautiously archived the data and invited independent review. These occurrences are presented publicly without sensationalism: staff encourage visitors to consider historical explanations while acknowledging that the house has an enduring reputation among Denver ghost enthusiasts.</p> \n\n<img src=\"https://images.pexels.com/photos/5765828/pexels-photo-5765828.jpeg?auto=compress&cs=tinysrgb&w=1200&h=800&fit=crop\" alt=\"Historic Denver hotel at twilight\" loading=\"lazy\" style=\"border-radius: 8px; width: 100%; height: auto; margin: 1.5rem 0;\" />\n\n<h2>The Oxford Hotel & Room 320 — 1600 17th Street</h2> <p>Are you curious why a single hotel room can become a focal point for ghost stories? The Oxford Hotel’s Room 320 (1600 17th Street, Denver, CO 80202) is one of those rooms. Built in 1891 as Denver’s premier urban lodging, the Oxford blends Victorian charm with contemporary use; Room 320, in particular, has an on-and-off reputation for unusual activity that attracts investigators and guests intrigued by the [Denver ghost] label.</p> <h3>History</h3> <p>The Oxford opened in the early 1890s and has been through restorations that retained its historical façade and many interior features. Over the decades it has hosted theatrical talent, politicians and traveling entrepreneurs. The hotel’s continuous hospitality function means stories of lost luggage, late-night music and staff encounters have accumulated in oral history and in hotel logs, which researchers sometimes consult when studying reputed hauntings.</p> <h3>Paranormal reports</h3> <p>You’ll encounter several common reports about Room 320: a cold patch in the center of the room, lights that flicker only in the dead of night, and an occasional scent of perfume when no one is present. Guests have left written testimony in the hotel’s guestbook describing unexplained taps on the door at 3:00 a.m. and the impression that someone sat on the bed. On one well-documented occasion, a guest attending a wedding in 2012 reported seeing a shadowed figure cross the doorway; the hotel manager at the time placed a notation in the log and reported no physical explanation. Investigators who recorded the room have found ambient noises amplified by the building’s old plumbing and ducts—factors you should consider if you want to separate folklore from possible environmental causes. Still, Room 320 is often listed on Denver haunted walking tours and local [Denver haunted] roundups because of the strength and frequency of personal accounts.</p> \n\n<img src=\"https://images.pexels.com/photos/6494953/pexels-photo-6494953.jpeg?auto=compress&cs=tinysrgb&w=1200&h=800&fit=crop\" alt=\"Weathered cemetery headstones in fog\" loading=\"lazy\" style=\"border-radius: 8px; width: 100%; height: auto; margin: 1.5rem 0;\" />\n\n<h2>Cheesman Park & The Old City Cemetery (Cheesman Park area)</h2> <p>Have you noticed that parks with layered uses often carry heavier reputations? Cheesman Park, located roughly between 8th Avenue, 10th Avenue, Clarkson Street and Williams Street, overlays an older burial ground and has been central to Denver’s urban development since the late 19th century. Because earth was moved and graves were reportedly disturbed during the park’s development, this location is persistently cited in stories about the Denver haunted landscape and is a core subject for anyone researching a Denver ghost narrative.</p> <h3>History</h3> <p>Originally the site was Prospect Hill Cemetery, active from the mid-1800s. In the 1890s the city dismantled portions of the cemetery to create what became Cheesman Park, a planned public open space. The displacement of graves—and uneven records of reinterment—contributed to long-term unease about the site. Local historians note that while many bodies were moved, documentation from the era is incomplete; that legal and archival ambiguity fuels modern speculation and responsible scholarly inquiry alike.</p> <h3>Paranormal reports</h3> <p>You’ll read numerous accounts from joggers, dog walkers and photographers who report feeling watched, seeing fleeting figures among the trees or encountering inexplicable cold spots near the park’s east side. Photographers sometimes capture orbs or light anomalies—often explainable by flash and sensor artifacts—but the volume of eyewitness testimony has kept Cheesman Park prominent in lists of Denver ghost hotspots. In a widely circulated 2008 compilation of local paranormal anecdotes, a landscape maintenance worker described hearing whispering voices at dusk and finding fresh soil over an area that city records listed as cleared; city archives show subsequent efforts to reconcile burial records, which adds a documentary layer to the folklore. As with other sites, you should weigh environmental, photographic and psychological explanations alongside eyewitness reports when forming conclusions.</p> \n\n<img src=\"https://images.pexels.com/photos/6494669/pexels-photo-6494669.jpeg?auto=compress&cs=tinysrgb&w=1200&h=800&fit=crop\" alt=\"Misty mountain town street at night\" loading=\"lazy\" style=\"border-radius: 8px; width: 100%; height: auto; margin: 1.5rem 0;\" />\n\n<h2>Grant-Humphreys Mansion — 770 Pennsylvania Street</h2> <p>Would you expect a stately mansion that has hosted governors and social events to keep secrets? The Grant-Humphreys Mansion (770 Pennsylvania Street, Denver, CO 80203) was built in 1902 for James Benton Grant, Colorado’s third governor, and later associated with the Humphreys family. Today it’s known for both its gilded-era architecture and a roster of uncanny anecdotes connecting the building’s past to present-day experiences. You’ll encounter this mansion in both architectural histories and in lists of Denver haunted locations.</p> <h3>History</h3> <p>Completed in 1902 and designed in a Beaux-Arts style, the mansion reflects Denver’s transformation into a state capital with national aspirations. It has housed private families, social clubs and, later, institutional uses. Records show Governor James Benton Grant commissioned the residence shortly after his term (1883–1885), and the Humphreys era added social prominence. The building’s changing uses have preserved interiors and created records—ledgers, photographs and event programs—that researchers use to contextualize oral histories.</p> <h3>Paranormal reports</h3> <p>You’ll hear that the mansion produces cold spots, piano music with no visible player, and footsteps in closed-off rooms. Staff who worked there during the late 20th century reported objects shifting between tours and an instance where a curator found a closed door open that she had locked the previous evening—accounts the mansion’s preservation team documented in internal logs. A 1999 evening tour recorded a faint, rhythmic tapping above the grand stairwell that could not be attributed to HVAC or known building systems; the pattern matched neither the maintenance schedule nor external traffic. The mansion’s witness accounts are presented alongside building plans and maintenance records to help separate residual environmental causes from experiences that remain unexplained.</p> <h2>Byers-Evans House / History Colorado Center area — 1310 Bannock Street and nearby</h2> <p>Would you like to learn how civic founders and newspaper magnates can become part of the city’s spectral story? The Byers-Evans House (1310 Bannock Street, Denver, CO 80204) sits near the modern History Colorado Center and was home to William N. Byers and, later, members of the Evans family. The site connects civic history to the [Denver ghost] narrative because the house preserves original materials and because its occupants were central to Denver’s cultural life for decades.</p> <h3>History</h3> <p>William Newton Byers founded the Rocky Mountain News in 1859, and his residence—later modified by the Evans family—reflects Denver’s maturation from frontier town to regional center. The house’s architecture and preserved rooms offer windows into 19th- and early-20th-century life; that continuity is why the property features in guided history walks and why it attracts attention from those interested in hauntings. Property deeds, census records and contemporary newspaper accounts document the family’s public roles and provide firm dates for researchers.</p> <h3>Paranormal reports and practical summary</h3> <p>You’ll find a compact set of stories about quiet footsteps in upstairs rooms, a transient scent of tobacco in the study and a sense of movement in rooms between scheduled tours. Docents have occasionally noted objects slightly out of place after closing—small items like buttons or paper ephemera—and archives teams have sometimes found soft, unexplained impressions on upholstered furniture that don’t match known wear patterns. These accounts typically appear in museum incident logs rather than sensational headlines; curators present them for public interest while emphasizing standard archival explanations (staff handling, climate variations, and settling wood). For practical orientation, here’s a small table summarizing the addresses and one-line notes for the sites covered above:</p> <p> <table> <tr> <th>Site</th> <th>Address</th> <th>Note</th> </tr> <tr> <td>Brown Palace Hotel & Spa</td> <td>321 17th Street, Denver, CO 80202</td> <td>Historic hotel with recurring staff and guest accounts</td> </tr> <tr> <td>Molly Brown House Museum</td> <td>1340 Pennsylvania Street, Denver, CO 80203</td> <td>Preserved home of Margaret “Molly” Brown; museum reports ambient phenomena</td> </tr> <tr> <td>The Oxford Hotel (Room 320)</td> <td>1600 17th Street, Denver, CO 80202</td> <td>Single-room reports of cold patches and unexplained sounds</td> </tr> <tr> <td>Cheesman Park / Old City Cemetery area</td> <td>8th–10th Avenues & Williams/Clarkson Streets</td> <td>Park built over old cemetery; persistent folklore and eyewitness accounts</td> </tr> <tr> <td>Grant-Humphreys Mansion</td> <td>770 Pennsylvania Street, Denver, CO 80203</td> <td>Gilded-era mansion with documented staff reports of sounds and movement</td> </tr> <tr> <td>Byers-Evans House</td> <td>1310 Bannock Street, Denver, CO 80204</td> <td>Historic residence with museum-recorded minor anomalies</td> </tr> </table> </p> <p>As you consider these places, keep two guiding principles in mind: first, specific dates, documents and architectural evidence often explain phenomena that sound supernatural; second, eyewitness testimony—whether from guests, staff, or investigators—matters and deserves respectful attention. For a reasoned look at Denver haunted history, combine archival research (deeds, newspapers and museum logs) with oral accounts and environmental checks; that balanced approach will help you decide which incidents remain unexplained and which likely have natural causes. Whether you’re interested in the [Denver ghost] stories as cultural folklore or as incidents that merit further investigation, these six sites offer a concentrated overview of the Mile High City’s darker side.</p>\n\n<hr />\n\n<h3>Continue Reading</h3>\n<ul>\n<li><a href=\"/articles/cheesman-park-denver-haunted-history/\">Cheesman Park: Denver's Cemetery Scandal and Its Restless Dead</a></li>\n<li><a href=\"/articles/stanley-hotel-colorado-shining-inspiration/\">The Stanley Hotel: The Real Inspiration for The Shining</a></li>\n<li><a href=\"/articles/brown-palace-hotel-denver-ghosts/\">The Brown Palace Hotel: Denver's Grandest Ghost Story</a></li>\n<li><a href=\"/denver-ghost-tours/\">Denver Ghost Tours — Complete Guide</a></li>\n</ul>",
  "excerpt": "Discover Denver's haunted sites - Brown Palace, Molly Brown, Oxford Room 320, Cheesman Park, Grant-Humphreys & Byers-Evans - history, reports and insight today.",
  "categories": [
    {
      "id": 595,
      "slug": "denver-haunted-history",
      "name": "Denver Haunted History",
      "description": "Articles exploring Denver's haunted hotels, Gold Rush ghosts, cemetery scandals, and the dark history of the Mile High City."
    }
  ],
  "pageType": "unassigned",
  "featuredImage": {
    "sourceUrl": "https://images.unsplash.com/photo-1570168007204-dfb528c6958f?w=1200&h=630&fit=crop&q=80",
    "altText": "Most Haunted Places in Denver: The Mile High City's Dark Side"
  }
}