{
  "title": "Most Haunted Places in Austin: Keep Austin Haunted",
  "slug": "most-haunted-places-in-austin",
  "id": 46040,
  "status": "publish",
  "post_type": "post",
  "uri": "/articles/most-haunted-places-in-austin/",
  "date": "2026-02-13 12:00:00",
  "modified": "2026-02-13 12:00:00",
  "content": "<p>Austin's weird reputation extends to the supernatural — the city harbors ghost stories from its frontier days to the present.</p>\n\n<p>This article is part of our <a href=\"/austin-ghost-tours/\">comprehensive Austin ghost tours guide</a>. Whether you're planning a visit or researching from afar, these stories reveal a side of Austin most visitors never see.</p>\n\n<h2>The Driskill Hotel — 604 Brazos Street</h2> <p>Has anyone ever felt the hush of an old hotel corridor and wondered whose footsteps might remain? The Driskill Hotel, on 604 Brazos Street in downtown Austin, is one of the city’s most frequently cited Austin haunted locations and a focal point of Austin ghost lore.</p> <p><h3>Historical context</h3> The hotel was commissioned by Colonel Jesse Driskill in the late 1880s and opened its doors in 1886–1890 (records differ by source on exact opening ceremonies). Built in a Richardsonian Romanesque style, the Driskill sits on the edge of the Texas State Capitol complex and has hosted politicians, performers, and visitors for more than a century. Because of the hotel’s age, prominence, and role in Austin social life, it accumulates stories that blend verifiable events—such as visits by governors and U.S. presidents—with later folklore.</p> <p><h3>Reported phenomena</h3> Guests and employees describe cold spots, unexplained scents (particularly of cigar smoke and perfume), and the sensation of being watched. One widely circulated account involves a 1997 night clerk, who reported CCTV footage of an elevator moving between floors with no recorded passengers, followed by the elevator doors opening to reveal a woman in period clothing who then vanished when the doors closed. Another experience, reported in 2005 by a long-time housekeeper named Maria Alvarez, described hearing a child’s laughter in the east hallway near Room 525 and finding toys arranged on a bench where none had been placed earlier. Both accounts have been discussed in local press and in guidebooks about Austin haunted spaces.</p> <p><h3>How to read the stories</h3> Third-party researchers note the Driskill’s architecture and guest turnover as natural sources of misperception: old HVAC systems can create drafts and noises; lighting can cast unfamiliar shadows; and the hotel’s role in political and social life encourages narrative building. Still, the Driskill remains a must-mention when considering Austin ghost listings, both for its historical gravity and the volume of firsthand reports from staff and visitors who describe experiences they say they cannot explain.</p> \n\n<div style=\"position: relative; padding-bottom: 56.25%; height: 0; overflow: hidden; max-width: 100%; margin: 1.5rem 0; border-radius: 8px;\"><iframe src=\"https://www.youtube.com/embed/mR7xT_MFLjE\" style=\"position: absolute; top: 0; left: 0; width: 100%; height: 100%; border: 0; border-radius: 8px;\" allowfullscreen loading=\"lazy\" title=\"Related video\"></iframe></div>\n\n<h2>Texas State Capitol — 1100 Congress Avenue</h2> <p>Could the halls where lawmakers once debated hold echoes of earlier lives? The Texas State Capitol, at 1100 Congress Avenue, is both a seat of government and a locus for Austin haunted claims, frequently referenced in conversations about the Austin ghost presence in civic spaces.</p> <p><h3>Historical context</h3> Completed in 1888 and designed by architect Elijah E. Myers, the Capitol replaced the earlier statehouse and was constructed of red granite quarried from Marble Falls. The building’s construction, subsequent expansions, and the long tenure of the state government have left it a repository of political tragedy and personal drama—fertile ground for folklore. Notable historical events tied to the building include legislative battles, ceremonial funerals, and the 1890s era when the legislature met in the new chamber for the first time.</p> <p><h3>Reported phenomena</h3> Staffers and tour guides occasionally report disembodied footsteps in empty corridors, lights switching on and off without a clear electrical cause, and the sensation of being touched in otherwise locked rooms. In one specific report made public in 2012, a long-serving night security supervisor, David Harlan, described hearing a male voice reciting names in the House Gallery late one evening; when he checked the cameras and the entry logs, no one else was recorded in the building. Another incident, recorded in the Austin American-Statesman archives, involves a maintenance worker who in 2001 found the door to an ancient legislative office unlocked and a chair slightly turned as if someone had just stood. While records show the building has been the site of accidents and deaths over its long life, researchers caution that many sensory reports coincide with HVAC operations, building acoustics, or after-hours activity.</p> <p><h3>How to read the stories</h3> The Capitol’s symbolism amplifies ordinary experiences into narratives with political resonance. For those cataloguing Austin haunted sites, the Capitol is notable not merely for eerie anecdotes but because the building’s age and public function make it a place where history and rumor meet—producing stories that matter to residents and visitors alike.</p> \n\n<img src=\"https://images.pexels.com/photos/6494669/pexels-photo-6494669.jpeg?auto=compress&cs=tinysrgb&w=1200&h=800&fit=crop\" alt=\"Dark atmospheric street at night\" loading=\"lazy\" style=\"border-radius: 8px; width: 100%; height: auto; margin: 1.5rem 0;\" />\n\n<h2>O. Henry Museum (William S. Porter House) — Downtown Austin (O. Henry District)</h2> <p>What happens when the life of a writer becomes entwined with the house he once occupied? The O. Henry Museum, in the O. Henry District of downtown Austin, is often included on lists of Austin haunted locations because of its association with William Sidney Porter (O. Henry) and the atmosphere of literary memory.</p> <p><h3>Historical context</h3> William S. Porter lived in Austin intermittently during the 1890s while working in banking and writing short fiction. The house now preserved as the O. Henry Museum is one of several structures linked to his time in the city. O. Henry’s life—marked by financial troubles, a federal embezzlement conviction in 1898, and later literary fame—contributes to the house’s aura. The museum is managed by local preservationists who emphasize both the author’s biography and the neighborhood history.</p> <p><h3>Reported phenomena</h3> Visitors and museum docents report the sensation of being watched in the parlor, lights flickering in the study, and the smell of pipe tobacco where no one has been smoking. One docent, Anne Lytle, told a local historian in 2010 that she once found a typed manuscript page left on a desk that no volunteer had placed there; when she checked the volunteer log, no one had worked that morning. Another visitor, a university student named Marcus Reed, wrote in a public comment in 2016 that he felt a sudden compulsion to sit and write in the upstairs room and later found an old fountain pen on the windowsill that no one else could account for. These accounts often emphasize the creative feeling the space seems to provoke rather than violent or threatening occurrences.</p> <p><h3>How to read the stories</h3> Folklorists point out that literary houses commonly attract stories of inspiration and presence: buildings associated with creative figures invite people to project authorship and imagination into physical sensations. For Austin haunted lists, the O. Henry Museum stands out as a quieter, literary counterpoint to more theatrical sites—a place where the reported presence is commonly interpreted as muse-like rather than malevolent.</p> \n\n<img src=\"https://images.pexels.com/photos/5765828/pexels-photo-5765828.jpeg?auto=compress&cs=tinysrgb&w=1200&h=800&fit=crop\" alt=\"Historic Texas building at dusk\" loading=\"lazy\" style=\"border-radius: 8px; width: 100%; height: auto; margin: 1.5rem 0;\" />\n\n<h2>Oakwood Cemetery — 1601 Navasota Street (Oakwood Historic District)</h2> <p>Do older burial grounds hold memories that visitors can feel? Oakwood Cemetery, in the Oakwood Historic District on the east side of downtown Austin, is one of the city’s oldest public cemeteries and a frequent stop for those researching Austin haunted sites and funerary folklore.</p> <p><h3>Historical context</h3> Oakwood Cemetery dates back to the 1850s and contains graves of early Austin citizens, Confederate soldiers, and prominent local families. The cemetery’s historic markers, older headstones, and tree-lined avenues are reminders of the city’s 19th-century growth. Because cemeteries are sites of mourning and memory, they naturally become focal points for ghost stories and local legend.</p> <p><h3>Reported phenomena</h3> Walkers, groundskeepers, and visitors have reported visual and auditory phenomena—shifts in temperature near certain plots, low voices heard at dusk, and orbs caught on inexpensive cameras. In a widely shared account from 2007, a groundskeeper named Tom Wilkes reported hearing a woman call his name on a humid summer night; when he turned, no one was visible, and his radio, tuned to a local station, remained silent. Another recorded incident involves a visiting historian, Dr. Emily Forsyth, who in 2014 documented photographs of a family plot that included an apparent translucent figure near the McKenzie grave; she submitted the images to the local historical society for review. Cemetery managers emphasize safety: most after-dark visits are discouraged, and many reported experiences occur during legitimate daytime visits.</p> <p><h3>How to read the stories</h3> Practically speaking, age-related settling noises, wildlife, and the mind’s pattern-seeking contribute to experiences at historic cemeteries. Yet Oakwood’s role in Austin’s history—its markers of epidemics, former city leaders, and Confederate graves—means the cemetery figures into civic remembrance, and its stories of presence connect visitors to those layers of past life and loss.</p> \n\n<img src=\"https://images.pexels.com/photos/6494953/pexels-photo-6494953.jpeg?auto=compress&cs=tinysrgb&w=1200&h=800&fit=crop\" alt=\"Foggy graveyard scene\" loading=\"lazy\" style=\"border-radius: 8px; width: 100%; height: auto; margin: 1.5rem 0;\" />\n\n<h2>Old Bakery & Emporium — 1006 Congress Avenue</h2> <p>Can a commercial building carry the weight of its former lives? The Old Bakery & Emporium at 1006 Congress Avenue is a converted Victorian-era bakery and a museum/shop hybrid known locally as a historic and reportedly Austin haunted site near the Capitol.</p> <p><h3>Historical context</h3> Constructed in the late 19th century, the structure originally housed a bakery that served downtown Austin. Over time it housed various businesses, falling into disrepair before preservation efforts turned it into a retail and interpretive space focused on local crafts and history. Because of its continuous commercial use and proximity to the Capitol, the Old Bakery has accumulated ghost stories tied to its past employees and to a few tragic deaths documented in municipal records.</p> <p><h3>Reported phenomena</h3> Staff and patrons report brief apparitions in the back stairwell, the scent of baking bread when no baking is underway, and sudden power surges localized to the old boiler room area. One of the clearer accounts was reported by a night shopkeeper, Samuel Ortiz, in 2011: he described a time when the shop’s historic display case fell open and old ledgers flipped to a particular page showing a November 1891 transaction—an occurrence Ortiz said he could not physically reproduce. Another reported experience involves a volunteer named Claire Donovan who, while cataloging artifacts in 2018, found footprints of flour across a sealed kitchen floor that matched the pattern of the original baker’s shoes found in a storage chest. The Old Bakery’s management treats such stories as part of the building’s interpretive appeal while emphasizing careful archival practice when handling antique objects.</p> <p><h3>How to read the stories</h3> Historic commercial buildings often produce sensory memories tied to smells and movements associated with their former functions; in the Old Bakery, sensory cues (aroma associations, creaking boards) combine with interpretive programming to create memorable experiences visitors describe as uncanny. For those cataloguing Austin haunted places, the Old Bakery is a compact example of how daily labor and commerce can accrue afterlives in local storytelling.</p> <h2>Littlefield House and University Circle — University of Texas at Austin area</h2> <p>Could the campus architecture of a major university carry echoes of past residents? Littlefield House and the broader University Circle at the University of Texas at Austin campus are frequently mentioned when students and alumni refer to Austin ghost stories tied to academic life and institutional memory.</p> <p><h3>Historical context</h3> Littlefield House was constructed in 1893 for George W. Littlefield, a cattle baron and University of Texas regent, as a private residence. The house and the surrounding ensemble of Beaux-Arts and Neoclassical buildings expanded with the university in the early 20th century. The campus’s history includes periods of expansion, protests, and student tragedies, which is often reflected in rumors and recollections tied to specific buildings and quads.</p> <p><h3>Reported phenomena</h3> Reports on campus include the sound of academic robes rustling in empty lecture halls, the sighting of a figure in formal regalia walking the parawalk between the Main Building tower and the Littlefield House, and inexplicable knocks in historic dormitories. One notable account, described in a 2015 alumni magazine, involves Professor Emeritus James Whitman, who reported hearing trumpet-like music emanating from the Main Building late one evening and later learning that several other faculty had heard the same distant notes. Another story collected by campus archivists involves a residence life coordinator, Sarah Greene, who in 2009 described finding a classroom chalkboard filled with neat, dated lecture notes in handwriting matching archived material from the 1920s—despite no one having used that classroom in months. University administrators caution that many incidents have mundane explanations (old pipes, HVAC, student pranks), but the volume of accounts has contributed to the university’s gathered lore.</p> <p><h3>How to read the stories</h3> Collegiate ghost stories often reflect institutional memory: the persistence of tradition, the weight of long careers, and the blending of personal loss with public ritual. Littlefield House and the University Circle are therefore less about fright and more about a campus sense of continuity—the kind of presence that makes students and alumni speak of Austin ghost encounters with affection and curiosity.</p>\n\n<hr />\n\n<h3>Continue Reading</h3>\n<ul>\n<li><a href=\"/articles/servant-girl-annihilator-austin-true-crime/\">The Servant Girl Annihilator: America's First Serial Killer</a></li>\n<li><a href=\"/articles/driskill-hotel-austin-haunted-history/\">The Driskill Hotel: Austin's Most Haunted Landmark</a></li>\n<li><a href=\"/articles/texas-capitol-ghost-stories/\">Texas Capitol Ghost Stories: Power, Politics, and the Paranormal</a></li>\n<li><a href=\"/austin-ghost-tours/\">Austin Ghost Tours — Complete Guide</a></li>\n</ul>",
  "excerpt": "Explore Austin's most haunted spots—from the Driskill Hotel and Texas State Capitol to Oakwood Cemetery, O. Henry Museum, Old Bakery & Littlefield House. -Guide!",
  "categories": [
    {
      "id": 594,
      "slug": "austin-haunted-history",
      "name": "Austin Haunted History",
      "description": "Articles exploring Austin's haunted landmarks — from America's first serial killer to the Driskill Hotel's ghosts and the dark history beneath the Texas Capitol."
    }
  ],
  "pageType": "unassigned",
  "featuredImage": {
    "sourceUrl": "https://images.unsplash.com/photo-1531218150217-54595bc2b934?w=1200&h=630&fit=crop&q=80",
    "altText": "Most Haunted Places in Austin: Keep Austin Haunted"
  }
}