{
  "title": "Most Haunted Places in New Orleans",
  "slug": "most-haunted-places-in-new-orleans",
  "id": 45203,
  "status": "publish",
  "post_type": "post",
  "uri": "/articles/most-haunted-places-in-new-orleans/",
  "date": "2026-02-05 12:00:00",
  "modified": "2026-02-05 12:00:00",
  "content": "New Orleans contains more allegedly haunted locations per square mile than any other American city. This is not merely a tourism claim. The concentration reflects genuine history—centuries of epidemic disease, slavery, violence, and cultural practices that kept the dead present in daily life. The haunted reputation of New Orleans is built on real events in real buildings, many of which still stand and remain in active use.\n\nWhat follows is not a comprehensive catalog but a guide to the most historically significant and well-documented haunted locations in the city. Each site carries its own history, its own reported phenomena, and its own connection to <a href=\"/articles/new-orleans-voodoo-haunted-history-complete-guide/\">the broader haunted history of New Orleans</a>.\n\n<div style=\"position: relative; padding-bottom: 56.25%; height: 0; overflow: hidden; max-width: 100%; margin: 1.5rem 0; border-radius: 8px;\"><iframe src=\"https://www.youtube.com/embed/HDjZlcnetZQ\" style=\"position: absolute; top: 0; left: 0; width: 100%; height: 100%; border: 0; border-radius: 8px;\" allowfullscreen loading=\"lazy\" title=\"Related video\"></iframe></div>\n\n<h2>The LaLaurie Mansion</h2>\nAddress: 1140 Royal Street, French Quarter\nThe LaLaurie Mansion is the most infamous haunted house in New Orleans and arguably in the United States. In April 1834, a fire at the residence of Madame Delphine LaLaurie led to the discovery of enslaved people who had been tortured in the attic—chained, mutilated, and starved. The discovery provoked a mob that ransacked the house, but LaLaurie escaped to France.\n\n<a href=\"/articles/lalaurie-mansion-true-story/\">The full story of the LaLaurie Mansion</a> is more horrifying than any ghost story because its horrors were entirely human. The building has changed hands numerous times since 1834, and nearly every occupant has reported disturbances—screams from empty rooms, the sound of chains, apparitions in upper-floor windows. The house is privately owned and not open to the public, but it remains the centerpiece of virtually every ghost tour in the French Quarter.\n\n\n<img src=\"https://images.pexels.com/photos/21771326/pexels-photo-21771326.jpeg?auto=compress&cs=tinysrgb&w=1200&h=800&fit=crop\" alt=\"Historic New Orleans architecture with wrought-iron details\" loading=\"lazy\" style=\"border-radius: 8px; max-width: 720px; width: 100%; height: auto; margin: 2rem auto; display: block;\" />\n\n<h2>St. Louis Cemetery No. 1</h2>\n\n<img src=\"https://images.pexels.com/photos/6494953/pexels-photo-6494953.jpeg?auto=compress&cs=tinysrgb&w=1200&h=800&fit=crop\" alt=\"Foggy cemetery on a gloomy day with old headstones\" loading=\"lazy\" style=\"border-radius: 8px; max-width: 720px; width: 100%; height: auto; margin: 2rem auto; display: block;\" />\n\nAddress: 425 Basin Street\n\nThe oldest extant cemetery in New Orleans, dating to 1789, St. Louis Cemetery No. 1 is a labyrinth of above-ground tombs that has been called the most haunted cemetery in America. <a href=\"/articles/st-louis-cemetery-no-1-history-and-legends/\">Its history and legends</a> include the tomb of Marie Laveau, where visitors still leave offerings and mark X's in hope of granted wishes.\n\nReported phenomena include apparitions moving between tombs, the sensation of being touched by invisible hands, cold spots on hot days, and the figure of a tall man in a dark hat seen repeatedly near the cemetery's center. Access is now restricted to guided tours, partly to preserve the deteriorating tombs and partly to manage the volume of visitors drawn by the cemetery's reputation.\n\n\n\n<h2>The Gardette-LePretre House (The Sultan's Palace)</h2>\n\nAddress: 716 Dauphine Street, French Quarter\n\nThis elegant mansion carries one of the French Quarter's most gruesome legends. According to tradition, a Turkish sultan (or a man claiming to be one) rented the house in the mid-19th century and filled it with a harem, servants, and opulent furnishings. One morning, neighbors discovered everyone inside had been massacred—dismembered and buried in the courtyard. The sultan himself was reportedly buried alive.\n\nHistorical verification of this story is thin, but the building's haunted reputation is robust. Residents and passersby have reported Middle Eastern music emanating from empty rooms, the scent of incense, and apparitions in period dress visible through the windows.\n\n<h2>The Old Ursuline Convent</h2>\nAddress: 1100 Chartres Street, French Quarter\n\n<img src=\"https://images.pexels.com/photos/35596111/pexels-photo-35596111.jpeg?auto=compress&cs=tinysrgb&w=1200&h=800&fit=crop\" alt=\"New Orleans historic building with unique architecture\" loading=\"lazy\" style=\"border-radius: 8px; max-width: 720px; width: 100%; height: auto; margin: 2rem auto; display: block;\" />\n\nThe oldest building in the Mississippi Valley, dating to 1752, the Old Ursuline Convent carries legends involving vampires—the casket girls (filles à la cassette) who arrived from France in the 18th century carrying small caskets of belongings. Legend holds that some caskets contained vampires, and that the convent's sealed third-floor shutters keep them contained to this day.\n\nThe vampire legend is almost certainly apocryphal, but the convent has a genuine history involving yellow fever nursing, wartime service, and centuries of religious life. Reported phenomena include lights in sealed upper rooms, shadowy figures on the balcony, and the sounds of footsteps in empty corridors.\n\n<h2>The Hotel Monteleone</h2>\n\nAddress: 214 Royal Street, French Quarter\n\nOne of the grand hotels of New Orleans, the Monteleone has operated since 1886 and is one of the most haunted hotels in the South. The hotel itself acknowledges its haunted reputation, having been investigated by numerous paranormal research groups.\n\nThe most commonly reported ghost is a young boy, believed to be the child of a former guest who died of yellow fever on the property. Guests have reported doors opening and closing, lights flickering, and the sensation of a small hand tugging at clothing. The hotel's famous Carousel Bar—a revolving bar in the lobby—is said to be a particular hotspot for unexplained activity.\n\n\n\n<h2>Lafitte's Blacksmith Shop Bar</h2>\n\nAddress: 941 Bourbon Street, French Quarter\n\nOne of the oldest structures in the French Quarter, dating to the 1720s, this building operates today as a bar but carries the name and legend of <a href=\"/articles/jean-lafitte-pirate-ghost-of-new-orleans/\">Jean Lafitte, the pirate</a> who allegedly used it as a front for his smuggling operations. Whether Lafitte actually used this specific building is debated, but the association has persisted for two centuries.\n\nThe bar is lit almost entirely by candlelight, creating an atmosphere that makes it easy to imagine ghosts in every corner. Reported phenomena include the apparition of a man in period clothing near the fireplace, objects moving on their own, and red eyes glowing in dark corners. Staff members have reported the sensation of being watched and unexplained cold drafts.\n\n<h2>The Beauregard-Keyes House</h2>\n\nAddress: 1113 Chartres Street, French Quarter\n\nThis 1826 raised cottage served as the temporary residence of Confederate General P.G.T. Beauregard and later as the home of novelist Frances Parkinson Keyes. The house's haunted reputation centers on reports of Civil War soldiers seen fighting in the courtyard and ballroom, apparently reenacting a battle that never took place at this location.\n\nOther reported phenomena include piano music from empty rooms, the scent of roses without any flowers present, and the apparition of a woman in white on the second-floor gallery.\n\n<h2>The Bourbon Orleans Hotel</h2>\nAddress: 717 Orleans Street, French Quarter\n\nBuilt on the site of the Orleans Ballroom, where the quadroon balls of antebellum New Orleans took place, this hotel carries the weight of particularly painful history. The quadroon balls were events where wealthy white men chose mixed-race women as mistresses in formalized arrangements called plaçage. The ballroom later served as a convent and orphanage.\n\nGhosts reported here include children playing in the hallways, a Confederate soldier on the sixth floor, a woman dancing alone in the ballroom, and nuns gliding through corridors. The hotel's history encompasses slavery, exploitation, religious life, and childhood death—layers of suffering that the building seems unable to shed.\n\n\n\n<h2>The Pharmacy Museum</h2>\n\nAddress: 514 Chartres Street, French Quarter\n\nThe New Orleans Pharmacy Museum occupies the building where America's first licensed pharmacist, Louis Joseph Dufilho Jr., practiced in the 1820s. A later occupant, Dr. Dupas, was rumored to conduct experiments on enslaved people and unsuspecting patients, testing medicines and performing surgeries of questionable necessity.\n\nVisitors and staff have reported the apparition of a man in 19th-century medical attire, unexplained sounds of glass breaking in the courtyard, and the sensation of being grabbed or pushed in the rear garden.\n\n<h2>Muriel's Jackson Square</h2>\n\nAddress: 801 Chartres Street, French Quarter\n\nThis restaurant, housed in a building dating to 1718, maintains a table permanently set for its resident ghost—believed to be Pierre Antoine Lepardi Jourdan, who lost the building in a poker game and subsequently took his own life on the second floor. Staff set a place with bread and wine each evening, and the table remains reserved throughout service.\n\nReported phenomena include glasses moving on their own, the sound of footsteps on the second floor after closing, and unexplained cold spots near the reserved table. The restaurant treats its ghost with humor and respect—an approach characteristic of New Orleans' pragmatic relationship with its supernatural residents.\n\n<h2>Visiting the Haunted City</h2>\n\n<img src=\"https://images.pexels.com/photos/65441/pexels-photo-65441.jpeg?auto=compress&cs=tinysrgb&w=1200&h=800&fit=crop\" alt=\"Night street with illuminated old buildings\" loading=\"lazy\" style=\"border-radius: 8px; max-width: 720px; width: 100%; height: auto; margin: 2rem auto; display: block;\" />\n\nNew Orleans' haunted locations are best experienced with context. <a href=\"/articles/new-orleans-ghost-tours-what-to-expect/\">Ghost tours</a> provide historical narrative that transforms individual sites into a connected story of the city's past. <a href=\"/articles/new-orleans-french-quarter-ghost-stories/\">The ghost stories of the French Quarter</a> are most compelling when understood not as isolated spooky tales but as expressions of the city's layered, unresolved history.\n\n<hr />\n\n<h3>Continue Reading</h3>\n<ul>\n<li><a href=\"/articles/lalaurie-mansion-true-story/\">The LaLaurie Mansion: True Story</a></li>\n<li><a href=\"/articles/new-orleans-french-quarter-ghost-stories/\">French Quarter Ghost Stories</a></li>\n<li><a href=\"/articles/st-louis-cemetery-no-1-history-and-legends/\">St. Louis Cemetery No. 1: History and Legends</a></li>\n<li><a href=\"/articles/new-orleans-voodoo-haunted-history-complete-guide/\">New Orleans Voodoo and Haunted History: Complete Guide</a></li>\n</ul>",
  "excerpt": "New Orleans has more allegedly haunted locations per square mile than any American city. These are the places with documented histories.",
  "categories": [
    {
      "id": 585,
      "slug": "new-orleans-voodoo-haunted-history",
      "name": "New Orleans Voodoo & Haunted History",
      "description": "Articles exploring the voodoo traditions, haunted landmarks, legendary figures, and dark history of New Orleans—from Marie Laveau and the LaLaurie Mansion to the city's unique burial customs and French Quarter ghost stories."
    }
  ],
  "pageType": "unassigned",
  "featuredImage": {
    "sourceUrl": "https://images.pexels.com/photos/951539/pexels-photo-951539.jpeg?auto=compress&cs=tinysrgb&w=800&h=450&fit=crop",
    "altText": "Most Haunted Places in New Orleans"
  },
  "wordCount": 1377,
  "readingTime": 6,
  "articleType": "pillar"
}