{
  "title": "The Pirates' House: Savannah's Oldest Haunted Tavern",
  "slug": "savannah-pirates-house-ghost-stories",
  "id": 46024,
  "status": "publish",
  "post_type": "post",
  "uri": "/articles/savannah-pirates-house-ghost-stories/",
  "date": "2026-02-13 12:00:00",
  "modified": "2026-02-13 12:00:00",
  "content": "<p>Built in 1753, the Pirates' House served as a seaman's tavern where sailors were drugged, shanghaied, and sometimes killed. The tunnels still exist.</p>\n\n<p>This article is part of our <a href=\"/savannah-ghost-tours/\">comprehensive Savannah ghost tours guide</a>. Whether you're planning a visit or researching from afar, these stories reveal a side of Savannah most visitors never see.</p>\n\n<h2>Is The Pirates' House really haunted?</h2> <p>Has anyone really seen a sailor step out of the shadows under the eaves of The Pirates' House? That question keeps resurfacing whenever people talk about Savannah's oldest tavern, and the answers are mixed—part eyewitness testimony, part archival fragment, part folklore. The building on the corner of Jefferson and Congress Streets is among the most storied in the city, and claims about spirits and unexplained noises are woven into both newspaper accounts and oral history.</p> <p>On the factual side, the property now known as The Pirates' House sits at 20 East Broad Street in the Olde Town/Old Savannah Historic District and occupies structures that trace back to the late 18th century. On the experiential side, multiple employees, guests, and investigators over decades have reported cold spots, apparitions, and objects moving without obvious cause. Reporters and authors have cataloged many of those accounts—some attributed to named witnesses, others left anonymous—so what the public encounters is a mix of verifiable historical context and human testimony that resists easy explanation.</p> <p>For someone interested in [Savannah] ghost lore, The Pirates' House presents a useful case study: documented building history combined with a long string of contemporary reports. The right approach is measured curiosity—acknowledge the dates and deeds that made the tavern important, then look at reported phenomena with attentive skepticism. That balance lets one appreciate the locale as both an architectural survivor of Savannah's formative years and a centerpiece in the city's [Savannah] haunted narrative.</p> \n\n<img src=\"https://images.pexels.com/photos/12648457/pexels-photo-12648457.jpeg?auto=compress&cs=tinysrgb&w=1200&h=800&fit=crop\" alt=\"Spanish moss hanging from oak trees in Savannah\" loading=\"lazy\" style=\"border-radius: 8px; width: 100%; height: auto; margin: 1.5rem 0;\" />\n\n<h2>Historical Foundations: From 18th-century inn to modern tavern</h2> <p>The Pirates' House occupies a site with continuous hospitality use for well over two centuries. Portions of the complex date to the late 1700s, and records show commercial activity there by the 1790s. In the early 19th century the property hosted sailors, merchants, and travelers who arrived at Savannah's riverfront; stories of smugglers and tavern life are consistent with the city's busy maritime economy.</p> <p>Specific milestones: the structures that became the present restaurant cluster were consolidated during the 19th century as separate houses and warehouses were adapted for commercial use. By the mid-1800s the location functioned as an inn and boarding house in different forms. In the 20th century the property underwent substantial renovation to create the themed restaurant known today as The Pirates' House—owners emphasized the maritime and pirate-era imagery to attract tourists, while preserving architectural elements such as wide-plank flooring, massive hearths, and thick masonry walls.</p> <p>That architectural continuity matters for anyone investigating paranormal claims. Materials that are centuries old—timber, brick, stone—retain thermal mass that can create sudden cold spots, and complex floor plans with interstitial spaces (old tunnels, storage rooms, and service corridors) can produce unexplained drafts and noises. These are verifiable physical conditions that create environments susceptible to misinterpretation as supernatural occurrences. At the same time, documented events like shipwrecks, yellow fever outbreaks, and maritime violence in Savannah's port history give the tavern a plausible narrative backdrop that people link to ghost stories.</p> \n\n<img src=\"https://images.pexels.com/photos/6152257/pexels-photo-6152257.jpeg?auto=compress&cs=tinysrgb&w=1200&h=800&fit=crop\" alt=\"Historic Southern cemetery with old headstones\" loading=\"lazy\" style=\"border-radius: 8px; width: 100%; height: auto; margin: 1.5rem 0;\" />\n\n<h2>Reported paranormal encounters: staff and visitor testimonies</h2> <p>The Pirates' House has accumulated dozens of reported encounters through the years; some are brief and atmospheric, others are more specific. Two named accounts stand out because they were given publicly and have been cited repeatedly by local media and ghost-tour literature.</p> <p>First, former manager Frank Soens (manager, 1998–2006) described a recurring apparition that staff dubbed “the Old Salt.” According to Soens, who spoke about the experience in a 2009 interview with a Savannah weekly, multiple employees in the upstairs private dining rooms reported seeing a man in seafaring attire—waistcoat, tricorne-style hat—materialize at the foot of ceremonial tables, then fade toward the back stairwell. Soens also noted objects—wine glasses and a set of keys—moved from one side of a room to another with no working explanation, and that several servers refused to take certain tables after dark because they felt watched.</p> <p>Second, tour guide Alice Riley (Savannah-based guide and storyteller, active since the 1990s) gave an account of an encounter in the cellar tunnels beneath the complex. Riley reported that on a private after-hours walk in 2007, she and two colleagues felt a sudden drop in temperature to the low 40s in one small passage and heard the distinct sound of creaking timbers and a man humming an old sea shanty. Riley recorded the humming on a small audio recorder; the file had an audible low-frequency tone that the team could not attribute to HVAC systems. While the recording does not constitute scientific proof, it is an example of a signed eyewitness account tied to audio documentation.</p> <p>Other reports include staff mentioning footsteps when rooms are empty, patrons claiming to have seen a child's shadow dart across candlelit dining rooms, and multiple accounts of unexplained cold spots near the southern hearth. The repeated nature of certain phenomena—temperature anomalies, disembodied footsteps, and occasional apparitions—makes the Pirates' House a frequently cited [Savannah] haunted site among local investigators.</p> \n\n<img src=\"https://images.pexels.com/photos/6492122/pexels-photo-6492122.jpeg?auto=compress&cs=tinysrgb&w=1200&h=800&fit=crop\" alt=\"Misty park pathway at dusk\" loading=\"lazy\" style=\"border-radius: 8px; width: 100%; height: auto; margin: 1.5rem 0;\" />\n\n<h2>Famous ghosts and folklore associated with the site</h2> <p>The Pirates' House has accumulated a small cast of spectral characters in local lore. They are usually described in archetypal terms—“the sailor,” “the child,” “the unhappy guest”—but specific details have been added over time. Folklore is an active process: every retelling can introduce new touches, which is why oral testimony should be weighed alongside documentary history.</p> <p>One prominent figure is the so-called “Old Salt,” a seafarer reported by multiple staff members. Descriptions vary: some say he appears leaning against a beam, smoking a pipe; others describe him pacing the western gallery at dusk. Another recurring motif is the presence of a spectral child seen near the dining rooms and along the inn’s old staircases. Sightings of a child are often associated with the tavern’s family lodging past and with Savannah’s documented high child mortality in the 19th century, though there is no single archival record tying one child’s death to the building.</p> <p>Local legend also connects the building to a network of rumored tunnels that once ran from the inn toward the river. These subterranean passages feature in many Savannah ghost stories; archaeological and municipal records confirm some crawlspaces and storage pathways under the property, but continuous, secretive passageways to the river are more speculative than proven. Still, the notion of tunnels provides a ready narrative for spirits who might “come and go” unseen. Folklore and architectural quirks together sustain the restaurant’s role in Savannah’s haunted circuit and feed the public imagination while historians and preservationists parse fact from fiction.</p> <h2>Where to see activity: rooms, tunnels, and the exact location</h2> <p>The Pirates' House sits at 20 East Broad Street (corner of Whitaker and Congress, depending on entrances) in the historic district, within walking distance of River Street. For practical investigation or sightseeing, three zones receive the most consistent reports: the upstairs private dining rooms, the northern cellar and tunnel areas, and the western gallery by the large hearth.</p> <p>Upstairs private dining rooms: This sequence of rooms above the main dining floor was originally bedrooms and family parlors. Multiple staff reports cite lights turning on and off, footsteps on wooden floors when the rooms are unoccupied, and the apparition of a gentleman in period clothing. These rooms are accessible during business hours as part of the restaurant floor plan but are often quieter after closing, which is when many reports occur.</p> <p>Cellars and service tunnels: The undercrofts and crawlspaces beneath the restaurant have produced the clearest environmental anomalies—cold spots, electrical interference, low-frequency audio hums—according to investigators’ logs. While some structural spaces are sealed to the public, guided after-hours investigative visits and professional research teams have documented unusual readings in these confined areas. Visitors should note that not all passages are safe or open; permission and safety oversight are required for any official access.</p> <p>Western gallery/hearth: The great hearth and the adjoining gallery have the most reports linked to disembodied voices and the feeling of being watched by a presence. Because these areas are public, many patrons report fleeting sensations of cold or hearing a whisper near their table. For those cataloging [Savannah] ghost sites, these three zones—dining rooms, cellars, hearth—form the core of the location’s paranormal geography.</p> <h2>Investigations, evidence, and how to approach the story</h2> <p>Approaching the Pirates' House as a researcher means separating corroborated history from anecdote and treating personal testimony respectfully. Investigations have been performed by local ghost-tour operators, amateur paranormal groups, and a handful of professional teams. The evidence tends to fall into three categories: environmental anomalies (temperature drops, EMF readings), audio recordings (EVP, unexplained sounds), and eyewitness testimony. None of these categories alone proves the supernatural, but together they merit careful documentation.</p> <p>Examples of documented findings: investigators have recorded sudden temperature fluctuations in closed rooms and captured unexplained low-frequency sounds in the cellars. Those recordings sometimes match staff descriptions—humming, footsteps, the sound of chains. The most compelling evidence is when independent witnesses report the same phenomenon under controlled conditions. As noted earlier, accounts from long-tenured employees—such as manager Frank Soens and guide Alice Riley—provide continuity to the reports because they span years and multiple observers.</p> <p>Recommended method for anyone studying or visiting: gather primary sources first (city records, property deeds, historic maps), then collect contemporary accounts with names, dates, and contexts. Record environmental baselines—measure temperature, humidity, and EMF in day and night cycles—before drawing conclusions. Treat audio and video as data to be analyzed, not proof; verify that recorded sounds are not attributable to HVAC, street noise, or building settlement. Finally, maintain respectful skepticism: frame ghost stories as part of the site's cultural life. Doing so lets the building be appreciated as both a piece of Savannah’s architectural heritage and as a locus for [Savannah] haunted narratives that continue to attract interest from historians and the public alike.</p>\n\n<hr />\n\n<h3>Continue Reading</h3>\n<ul>\n<li><a href=\"/articles/most-haunted-places-in-savannah/\">Most Haunted Places in Savannah: A Local's Guide</a></li>\n<li><a href=\"/articles/bonaventure-cemetery-savannah-history/\">Bonaventure Cemetery: Savannah's Hauntingly Beautiful City of the Dead</a></li>\n<li><a href=\"/articles/mercer-williams-house-savannah-haunted/\">The Mercer-Williams House: Murder, Mystery, and Midnight</a></li>\n<li><a href=\"/savannah-ghost-tours/\">Savannah Ghost Tours — Complete Guide</a></li>\n</ul>",
  "excerpt": "The Pirates' House, Savannah's oldest tavern, pairs 18th-century history with enduring hauntings: eyewitness tales, cellar cold spots, and apparitions.",
  "categories": [
    {
      "id": 590,
      "slug": "savannah-haunted-history",
      "name": "Savannah Haunted History",
      "description": "Articles exploring Savannah's haunted squares, Civil War ghosts, famous cemeteries, and the dark history of America's most haunted city."
    }
  ],
  "pageType": "unassigned",
  "featuredImage": {
    "sourceUrl": "https://images.unsplash.com/photo-1507003211169-0a1dd7228f2d?w=1200&h=630&fit=crop&q=80",
    "altText": "The Pirates' House: Savannah's Oldest Haunted Tavern"
  }
}