{
  "title": "Why Were Women Targeted in the Salem Witch Trials?",
  "slug": "why-were-women-targeted-in-the-salem-witch-trials",
  "id": 45162,
  "status": "publish",
  "post_type": "post",
  "uri": "/articles/why-were-women-targeted-in-the-salem-witch-trials/",
  "date": "2026-01-13 05:16:52",
  "modified": "2026-01-30 07:12:18",
  "content": "Of the more than two hundred people accused of witchcraft during the Salem witch trials, approximately three-quarters were women. This striking disproportion was not accidental. It reflected deep-seated beliefs about gender, spirituality, and social order that made women—particularly certain kinds of women—vulnerable to accusation in ways that men were not.\n\nUnderstanding why women were targeted requires examining the intersection of Puritan theology, social structure, and the specific circumstances of late seventeenth-century New England.\n\n<h2>Theological Foundations of Female Vulnerability</h2>\n\nPuritan theology held that women were spiritually weaker than men and more susceptible to temptation. This belief traced back to Eve's role in the Fall—women had been the first to succumb to Satan's persuasion, and that original vulnerability was understood to persist across generations.\n\nThis theological framework did not mean Puritans believed all women were evil or that godly women could not achieve salvation. But it did mean that when communities sought explanations for spiritual attack, women were natural suspects. If the Devil was recruiting servants, women—by theological definition—were more likely to be seduced. <a href=\"/articles/were-the-salem-witch-trials-about-religion-or-power/\">Whether religion or power drove the trials</a> becomes clearer when examining these theological foundations.\n\nThe association between women and spiritual vulnerability was reinforced by broader cultural beliefs about female nature. Women were considered more emotional, more passionate, more governed by bodily impulses than rational men. These qualities, while not inherently sinful, were understood to create openings for satanic influence.\n\n<h2>Gender Expectations and Deviation</h2>\n\nPuritan society maintained strict expectations for female behavior. Women were supposed to be submissive to male authority—first fathers, then husbands. They were expected to be modest, quiet, industrious, and pious. They were to support their households without seeking public attention or exercising independent authority. Understanding <a href=\"/articles/life-in-puritan-new-england-before-the-trials/\">life in Puritan New England</a> reveals how strictly these norms were enforced.\n\nWomen who violated these expectations attracted attention and suspicion. A woman who spoke too boldly, who quarreled with neighbors, who failed to show proper deference, who asserted independence beyond her station—such a woman was already marked as problematic before any accusation of witchcraft arose. This intersection of gender norms and vulnerability is crucial to understanding <a href=\"/articles/the-salem-witch-trials-causes-consequences-and-lasting-legacy/\">the broader causes and consequences of the Salem witch trials</a>.\n\nThe accused women of Salem often fit this pattern. They were women who had in some way stepped outside expected roles: widows who controlled property, women who had challenged male authority, women known for sharp tongues or contentious dispositions. Their deviation from gender norms made witchcraft accusations seem plausible to their neighbors.\n\n<h2>Economic Vulnerability</h2>\n\nWomen's economic position in colonial New England created specific vulnerabilities. Property typically passed through male lines, and women's legal status was subordinate to fathers and husbands. Women who lacked male protectors—widows, unmarried women, women whose husbands were absent or incapacitated—occupied precarious positions.\n\nThis economic vulnerability took several forms. Women without male support might depend on charity from neighbors, creating resentment when assistance was sought. Widows who controlled property might be resented by male relatives who expected inheritance. Women engaged in informal economic activities—selling goods, providing services—might compete with male interests.\n\nThe accused included disproportionate numbers of women whose economic circumstances were anomalous or threatening. Sarah Good's poverty made her dependent on neighbors' goodwill. Sarah Osborne's control of property had brought her into conflict with her sons. <a href=\"/articles/who-were-the-accused-witches-of-salem/\">Who was actually accused</a> reveals these economic patterns clearly.\n\n<h2>Women as Healers and Midwives</h2>\n\nWomen in colonial New England often served as informal healers, providing medical care and midwifery services to their communities. These roles brought them into intimate contact with bodies, illness, birth, and death—domains that could easily be reinterpreted through supernatural lenses.\n\nWhen patients died, when births went wrong, when treatments failed, the women who had provided care might be blamed. The same knowledge that made them valuable as healers could be reinterpreted as dangerous knowledge of poisons and curses. The line between beneficial healing and maleficent witchcraft was dangerously thin.\n\nSeveral of the accused had reputations as healers or midwives. Their specialized knowledge, which had served their communities, became evidence against them when the framework of interpretation shifted from natural to supernatural.\n\n<h2>Sexual Suspicion and Moral Purity</h2>\n\nPuritan culture placed enormous emphasis on female sexual purity. Women who had violated sexual norms—through fornication, adultery, or even suspicion of impropriety—carried moral stains that made them vulnerable to other accusations.\n\nSeveral of the accused had histories that included sexual irregularity. Some had borne children outside marriage. Others had remarried too quickly after widowhood or had lived with men before formal marriage. These violations of sexual expectations provided additional fuel for accusation.\n\nThe association between witchcraft and sexuality was deeply embedded in European witch-hunting traditions. Witches were believed to have sexual relations with the Devil, to participate in obscene sabbaths, to corrupt the sexuality of others. Accusations of witchcraft carried implicit sexual charges that reinforced and amplified existing moral suspicions.\n\n<h2>Women's Caregiving and Vulnerability</h2>\n\nWomen's roles as caregivers created particular vulnerability. They prepared food, tended the sick, cared for children, and managed household animals. These responsibilities placed them in proximity to domains where misfortune could occur—and where blame could be assigned.\n\nIf a child fell ill after eating food a woman had prepared, she might be suspected. If livestock died under her care, she might be blamed. If a patient worsened after receiving her treatment, she might be accused. The very intimacy of women's caregiving work meant that they were present when things went wrong—and available as explanations.\n\nThis vulnerability was enhanced by the prevalence of conflict in daily life. Neighbors quarreled over small matters; harsh words were exchanged; grudges accumulated. A woman who had argued with a neighbor might find herself blamed for any subsequent misfortune that befell that neighbor's household. <a href=\"/articles/the-salem-witch-trial-accusers-who-were-they-really/\">The accusers</a> often drew on precisely these accumulated grievances.\n\n<h2>Older Women and Changing Status</h2>\n\nOlder women were disproportionately represented among the accused. Women past childbearing years, women who had outlived husbands, women whose social utility in a patriarchal system had diminished—these women occupied increasingly marginal positions.\n\nMenopause itself was viewed with suspicion in early modern culture. The cessation of menstruation was associated with the buildup of corrupt humors, emotional instability, and moral deterioration. Older women were believed to become more irritable, more envious, more dangerous as they aged.\n\nThe accused often fit this profile: women whose age had reduced their social standing, whose economic value had diminished, whose presence had become burdensome to communities or families. Their marginality made them available for sacrifice when communities sought explanations for misfortune.\n\n<h2>The Men Who Were Accused</h2>\n\nNot all those accused were women. Approximately one-quarter of the accused were men, and understanding why they were targeted illuminates the gendered logic of the trials by showing its exceptions.\n\nMen accused of witchcraft often shared characteristics that feminized them in the community's eyes: economic dependence, failed masculinity, association with accused women. Others were targeted because they defended accused wives or daughters. Still others had achieved notoriety through behavior that violated expectations in ways that paralleled female deviation.\n\nThe presence of male defendants did not undermine the gendered pattern—it confirmed it. Men were accused when they occupied positions analogous to vulnerable women, or when they allied themselves with accused women. Gender remained the primary organizing principle of vulnerability.\n\n<h2>Structural Patterns, Individual Victims</h2>\n\nThe gendered pattern of accusation was not random, but neither was it mechanical. Individual women were accused for individual reasons—specific conflicts, particular reputations, concrete incidents. But these individual cases accumulated into a pattern that reflected structural features of Puritan society. <a href=\"/articles/how-the-salem-witch-trials-worked-courts-evidence-and-confessions/\">How the courts operated</a> amplified rather than corrected these biases.\n\nWomen were vulnerable not because of any essential female characteristic, but because of how gender was organized in their society. The theological beliefs, economic arrangements, social expectations, and legal structures of Puritan New England combined to make certain kinds of women available as targets when communities sought to explain misfortune through witchcraft.\n\n<h2>The Lesson of Gendered Accusation</h2>\n\nThe targeting of women in Salem carries lessons beyond its historical moment. It demonstrates how structural inequalities create vulnerability, how deviation from expected norms attracts punishment, and how systems of belief can provide justification for discrimination that might otherwise be recognized as unjust. <a href=\"/articles/what-the-salem-witch-trials-teach-us-about-moral-panic/\">What Salem teaches us about moral panic</a> illuminates these recurring patterns.\n\nThe women of Salem were not accused because they were witches. They were accused because they were women—women of particular kinds, in particular positions, within a particular social structure. Their tragedy reveals how societies can mobilize against the vulnerable when fear demands explanation and existing inequalities provide targets.\n\nUnderstanding why women were targeted is essential to understanding Salem. It is also essential to recognizing similar dynamics wherever they appear. <a href=\"/articles/why-the-salem-witch-trials-still-matter-today/\">Why Salem still matters today</a> lies precisely in this enduring relevance.\n\n<hr />\n\n<h3>Continue Reading</h3>\n<ul>\n<li><a href=\"/articles/the-salem-witch-trials-causes-consequences-and-lasting-legacy/\">The Salem Witch Trials: Causes, Consequences, and Lasting Legacy</a></li>\n<li><a href=\"/articles/who-were-the-accused-witches-of-salem/\">Who Were the Accused Witches of Salem?</a></li>\n<li><a href=\"/articles/the-salem-witch-trial-accusers-who-were-they-really/\">The Salem Witch Trial Accusers: Who Were They Really?</a></li>\n<li><a href=\"/articles/life-in-puritan-new-england-before-the-trials/\">Life in Puritan New England Before the Trials</a></li>\n<li><a href=\"/salem-ghost-tours/\">Salem Ghost Tours Hub</a></li>\n</ul>",
  "excerpt": "Of the more than two hundred people accused of witchcraft during the Salem witch trials, approximately three-quarters were women.",
  "categories": [
    {
      "id": 583,
      "slug": "salem-witch-trials",
      "name": "Salem Witch Trials",
      "description": "In-depth articles exploring the history, causes, trials, and lasting legacy of the Salem Witch Trials of 1692, examining how fear, law, and belief combined to shape one of the most infamous events in American history."
    }
  ],
  "pageType": "unassigned",
  "featuredImage": {
    "sourceUrl": "https://images.unsplash.com/photo-1508615070457-7baeba4003ab?w=1200&h=630&fit=crop&q=80",
    "altText": "Woman in silhouette against a moody dark background",
    "width": 1200,
    "height": 630
  },
  "wordCount": 1476,
  "readingTime": 6,
  "articleType": "pillar"
}